{"url":"https://cumetv.fandom.com/wiki/New_Orlando","content":{"title":"New Orlando | CumeTV Wiki | Fandom","description":"New Orlando is a city in Lunar Region 5, the largest city by area and densest by population on Earth and the moon. It attracts 10 million visitors annually and is home to major tourist attractions, hotels, and casinos. The city was established in 2028 and has experienced rapid growth, with a population of 5 million as of 2035. It is owned by the New Orlando Conglomerate and features a unique culture with strict laws in the autonomous Nick Land region.","bodyContent":"CumeTV Wiki\nEXPLORE\nWIKI CONTENT\nCOMMUNITY\n FANDOM\nFAN CENTRAL\nBETA\nGAMES\nANIME\nMOVIES\nTV\nVIDEO\nWIKIS\nSTART A WIKI\nSIGN IN\nREGISTER\nCumeTV Wiki\n43\nPAGES\nEXPLORE\nWIKI CONTENT\nCOMMUNITY\nin: Cities\nNew Orlando\nSIGN IN TO EDIT\n\nNew Orlando is a city in Lunar Region 5. It is the largest city by area and the densest by population on both Earth and the moon. Home to many major tourist attractions, hotels, and casinos, it draws an annual estimate of 10,000,000 visitors, over 30% of Earth's total population.\n\nContents\n1\tHistory\n2\tGeography\n3\tEconomy\n4\tCulture\n5\tNotable People\nHistory\n\nEstablished in 2028 as one of the earliest lunar cities, New Orlando was built around the first lunar tourism base, initially as a series of hotels for visitors who couldn't afford to stay on the base proper. When Nick Land broke ground in 2030, speculation drove companies to build infrastructure, hotels, and housing at a rapid pace. A series of timeshares constructed and maintained by MoonTimeX further contributed to this explosive growth, and the city's population is estimated at 5,000,000 as of 2035.\n\nGeography\n\nNew Orlando, like its Earth-based namesake, is flat and barren. Water is drawn from a series of tubes connected to lunar ice caps. No natural bodies of water exist, though a number of indoor beaches serve inhabitants.\n\nEconomy\n\nNew Orlando is owned by the New Orlando Conglomerate, a firm consisting of Somewhere Systems, MoonTimeX, Booble, and Taco Bell. Many industries call New Orlando home, such as technology, tourism, and CumeTV production.\n\nCulture\n\nThe city's culture largely consists of tourist attractions and buffets with stale food. Nick Land is the largest owner of land, and through an arrangement with the city's governance, it is an autonomous region with a distinct set of laws. It is recommended that visitors hire tour guides with knowledge on Nick Land law before entering the park, as law enforcement on the park's grounds is known to be strict. It is estimated that 500 people die yearly in Nick Land Prison, though as official death tolls are not publicly available, this number may be much higher.\n\nOther significant landmarks include Hal Rainbow's Pleasure Dome, the New Orlando Zoo, McDonald's XII Libertarian University, and Someplace.\n\nNotable People\n\nHal Rainbow, entrepreneur\n\nElon Musk, Jr.\n\nCategories\nCommunity content is available under CC-BY-SA unless otherwise noted.\nEXPLORE PROPERTIES\nFandom\nMuthead\nFanatical\nFOLLOW US\nOVERVIEW\nWhat is Fandom?\nAbout\nCareers\nPress\nContact\nTerms of Use\nPrivacy Policy\nDigital Services Act\nGlobal Sitemap\nLocal Sitemap\nCOMMUNITY\nCommunity Central\nSupport\nHelp\nDo Not Sell or Share My Personal Information\nADVERTISE\nMedia Kit\nContact\nFANDOM APPS\nTake your favorite fandoms with you and never miss a beat.\nCumeTV Wiki is a FANDOM Lifestyle Community.\nVIEW MOBILE SITE\nFollow on IG\nTikTok\nJoin Fan Lab\nCheck out Fandom\nSearch this wiki\nSearch all wikis"}}