{"id":"0d55e5d3-62a3-0f3c-81bf-172dc3923eb9","url":"https://www.youtube.com/watch?v=PTdxPliBdZs","title":"Hank of the Hill (Re-Upload)","source":"Canned Bread","description":"Disclaimer: I do not own anything. \nOriginal Creator: https://www.youtube.com/user/DurhamrockerZ \nEnjoy the video! : ) \nI made a slight edit to the \"boggle\" part. Sorry about that.\nPlease be sure to dislike, unsubscribe, and troll the comment section.","text":"[Music] I tell you I hate Nancy it's a beautiful\nday yay Sunday\nSunday and Saturday it's the N anel\nDallas mow Expo be there as the biggest\nnames in mow hitchers and Clippers on H\nand Clippers on H and Clippers on Sunday\ncutting\ntechnology K SE King oil paintings boil\npaintings seeing don't miss the Dallas\nmower XO SC be\n[Music]\nthere doesn't count men I guess I win\nagain boy a peg the words I don't know\ncould fill a dick you know the Elks are\nhaving a Boggle tournament to raise ba\nmoney for their treasurer\nmaybe you should enter Boggle Bogle\nBogle\n[Music]\nBoggle all right Peggy I replaced my\nwatch battery ate a Cinnabon and bought\na P trap I can't kill any more time\nlet's go shank it is only round five\nlet's\ngo H impatient\n[Music]\nBogle oh little sick boy would you like\nfor me to find your name in the next\nBoggle Bogle ble\nokay boy that wife of yours is pretty\ngood I Guess That's Why They Call Her\nyour\nbetter who calls her\nthat he you want to be my coach oh\nBoggle coach what would I do well Hank\nyou don't have to you don't have to do\nanything you just have to be there\nunless you want me to go off to Dallas\nby myself Dallas\n[Music]\nsent crackheads and debutants\nSunday guess who's going to the mower\nshow who boy how'd you manage to swing\nthat boy Peggy we like mowers simp\nsimple I found a Boggle tournament in\nDallas to keep her busy while we have\nhave some real fun check it out man talk\nabout a road trip Big D Motel man you\ntalk about the biggest names in mowers\nedges and Clippers be there man it's\ngoing to\nbe let's go Peggy\n[Music]\n[Music]\nR I also I\nalso you look like you could use a\nwallet would you like to make a\nwallet uh Harley-Davidson Hank is not\njust my husband he is also my coach\noh well then you'll be needing one of\nthese yeah good\nasleep now you listen to me the name is\nHank Hill Mr Hank Hill Peggy married me\nI didn't marry\nher okay the guy at Home Depot said all\nwe got to do is strip sand varnish buff\nvarnish buff varnish waack sand buff\nbuff buff B God\nno that it was\nclose I see myself in the winter Circle\nand you are right there next to me my\ncoach my big ass man\n[Music]\ndang winner loser you're a loser are you\nfeeling sorry for yourself well you\nshould be cuz you are dirt you make me\nsick you big baby baby want a bottle a\nbig dirt bottle are you yelling me\nyou're a loser look I can't afford any\nmore screw-ups I just spent my last\ndollar on deodorizing carpet\nceiling look at all boow I than don't\npick up that dang old rock man dang old\npie D fcked up get out\nthere I ain't got no fingers all right\nit's going to be best of three I want a\nclean game no foreign words no foreign\nobjects\n[Music]\nShake yeah Peggy held is down to her\nlast pencil she has no more pencils in\nreserve\npencil ah this is awful I think it's\nit's all over for Peggy\nHill loser now let's show them how we\nPlay Boggle and Arland whatever you say\ncoach oh you\n[Music]\nyeah painful\n[Music]\nPeggy Hill was riding up a storm but\nwill it be enough I\nwin loser you're a loser are you feel\nsorry\n[Music]\nfor Boggle"}