{"url":"https://huggingface.co/black-forest-labs/FLUX.1-dev","content":{"title":"black-forest-labs/FLUX.1-dev · Hugging Face","description":"A 12 billion parameter rectified flow transformer capable of generating images from text descriptions, developed by Black Forest Labs. It offers cutting-edge output quality, competitive prompt following, and open weights for scientific research and artistic innovation.","bodyContent":"Hugging Face\nModels\nDatasets\nSpaces\nPosts\nDocs\nPricing\nLog In\nSign Up\nblack-forest-labs\n/\nFLUX.1-dev \nlike\n6.08k\nFollow\nBlack Forest Labs\n1,579\nText-to-Image\nDiffusers\nSafetensors\nEnglish\nFluxPipeline\nimage-generation\nflux\nInference Endpoints\nLicense:\nflux-1-dev-non-commercial-license\nModel card\nFiles and versions\nCommunity\n271\nDeploy\nUse this model\nEdit model card\nYou need to agree to share your contact information to access this model\n\nThis repository is publicly accessible, but you have to accept the conditions to access its files and content.\n\nBy clicking \"Agree\", you agree to the FluxDev Non-Commercial License Agreement and acknowledge the Acceptable Use Policy.\n\nLog in\nor\nSign Up\nto review the conditions and access this model content.\n\nFLUX.1 [dev] is a 12 billion parameter rectified flow transformer capable of generating images from text descriptions. For more information, please read our blog post.\n\nKey Features\nCutting-edge output quality, second only to our state-of-the-art model FLUX.1 [pro].\nCompetitive prompt following, matching the performance of closed source alternatives .\nTrained using guidance distillation, making FLUX.1 [dev] more efficient.\nOpen weights to drive new scientific research, and empower artists to develop innovative workflows.\nGenerated outputs can be used for personal, scientific, and commercial purposes as described in the FLUX.1 [dev] Non-Commercial License.\nUsage\n\nWe provide a reference implementation of FLUX.1 [dev], as well as sampling code, in a dedicated github repository. Developers and creatives looking to build on top of FLUX.1 [dev] are encouraged to use this as a starting point.\n\nAPI Endpoints\n\nThe FLUX.1 models are also available via API from the following sources\n\nbfl.ml (currently FLUX.1 [pro])\nreplicate.com\nfal.ai\nmystic.ai\nComfyUI\n\nFLUX.1 [dev] is also available in Comfy UI for local inference with a node-based workflow.\n\nDiffusers\n\nTo use FLUX.1 [dev] with the 🧨 diffusers python library, first install or upgrade diffusers\n\npip install -U diffusers\n\n\nThen you can use FluxPipeline to run the model\n\nimport torch\nfrom diffusers import FluxPipeline\n\npipe = FluxPipeline.from_pretrained(\"black-forest-labs/FLUX.1-dev\", torch_dtype=torch.bfloat16)\npipe.enable_model_cpu_offload() #save some VRAM by offloading the model to CPU. Remove this if you have enough GPU power\n\nprompt = \"A cat holding a sign that says hello world\"\nimage = pipe(\n    prompt,\n    height=1024,\n    width=1024,\n    guidance_scale=3.5,\n    num_inference_steps=50,\n    max_sequence_length=512,\n    generator=torch.Generator(\"cpu\").manual_seed(0)\n).images[0]\nimage.save(\"flux-dev.png\")\n\n\nTo learn more check out the diffusers documentation\n\nLimitations\nThis model is not intended or able to provide factual information.\nAs a statistical model this checkpoint might amplify existing societal biases.\nThe model may fail to generate output that matches the prompts.\nPrompt following is heavily influenced by the prompting-style.\nOut-of-Scope Use\n\nThe model and its derivatives may not be used\n\nIn any way that violates any applicable national, federal, state, local or international law or regulation.\nFor the purpose of exploiting, harming or attempting to exploit or harm minors in any way; including but not limited to the solicitation, creation, acquisition, or dissemination of child exploitative content.\nTo generate or disseminate verifiably false information and/or content with the purpose of harming others.\nTo generate or disseminate personal identifiable information that can be used to harm an individual.\nTo harass, abuse, threaten, stalk, or bully individuals or groups of individuals.\nTo create non-consensual nudity or illegal pornographic content.\nFor fully automated decision making that adversely impacts an individual's legal rights or otherwise creates or modifies a binding, enforceable obligation.\nGenerating or facilitating large-scale disinformation campaigns.\nLicense\n\nThis model falls under the FLUX.1 [dev] Non-Commercial License.\n\nDownloads last month\n1,239,638\nInference API\nWarm\nText-to-Image\nExamples\nCompute\nView Code\nMaximize\nModel tree for\nblack-forest-labs/FLUX.1-dev\nAdapters\n7424 models\nFinetunes\n238 models\nMerges\n2 models\nQuantizations\n14 models\nSpaces using\nblack-forest-labs/FLUX.1-dev\n100\n🖥️\nblack-forest-labs/FLUX.1-dev\n🏆\nmultimodalart/flux-lora-the-explorer\n🤗\nyanze/PuLID-FLUX\n🎀\nDamarJati/FLUX.1-RealismLora\n🔎\njasperai/Flux.1-dev-Controlnet-Upscaler\n🖼\nByteDance/Hyper-FLUX-8Steps-LoRA\n🌀\nmultimodalart/FLUX.1-merged\n🧪\nmultimodalart/flux-lora-lab\n🧋\nDamarJati/FLUX.1-DEV-Canny\n🧞\nautotrain-projects/train-flux-lora-ease\n📽\ndn6/FLUX-GIFs\n🖼\nmultimodalart/flux-cfg\n+ 88 Spaces\n© Hugging Face\nTOS\nPrivacy\nAbout\nJobs\nModels\nDatasets\nSpaces\nPricing\nDocs"}}