{"url":"https://app.podscribe.ai/episode/89348912","content":{"title":"\"#48 - Conner O'Malley\" episode transcripts, sponsors, audience info, episodes, content rating","description":"Conner O'Malley joins the podcast to discuss his film 'The Mask,' getting drunk in his basement in Chicago, squaring off with pops, a great idea for a new kind of airline, and much more. The conversation also touches on various personal topics, including relationships, family, and health issues.","bodyContent":"Discover shows\nPublishers\nSearch for a show, advertiser or publisher\nLog In\nSign Up\nStavvy's World\n\n#48 - Conner O'Malley\n\nPublished: 10/30/2023\n\n10/30/2023 - 1h 53m 23s \nDownloaded:\n\nDESCRIPTION\nTRANSCRIPT\n\nConner O'Malley joins the pod to discuss his film 'The Mask,' getting drunk in his basement in Chicago, squaring off with pops, a great idea for a new kind of airline, and much more. Conner and Stav help callers including a gas station employee who suspects his female boss is hitting on him, and a scientist whose overbearing coworker is stealing her notebooks and snooping way too much.\n\n\n\n\nWatch 'The Mask' and check out Conner O'Malley's comedy:\n\n\n\n\nhttps://www.endorphinport.com/\n\n\n\n\nFollow Conner O'Malley on social media:\n\n\n\n\nhttps://www.endorphinport.com/\n\nhttps://www.youtube.com/@omalleyrock\n\nhttps://www.instagram.com/conner_omalley_\n\nhttps://www.tiktok.com/@conner_omalley_\n\nhttps://twitter.com/conner_omalley\n\n\n\n\nUnlock exclusive episodes at https://www.patreon.com/stavvysworld\n\n\n\n\nWanna be part of the show? Call 904-800-STAV and leave a voicemail to get advice!\n\nSpeakers\nTimes\n1  \n00:00:04\n\nWelcome everybody to Avi's World 9 0 4 eight hundred Stop. We'll, we'll, we're gonna solve all your problems, folks. We're feeling good. We're coming straight off the nuptials of Elda Soula. Congratulations, ELSs. I'm sure we'll get into this more later on, but our, our guest wasn't invited to your wedding. Yeah. You guys had, even though you guys had met one time at the Bellhouse \n\n0  \n00:00:28\n\nYeah, dude. After a show, which is pretty rude. It was like, \n\n2  \n00:00:31\n\nHey, anyone in New York? Come on down. \n\n0  \n00:00:34\n\nNo biggie. \n\n2  \n00:00:35\n\nYou're in the neighborhood. \n\n1  \n00:00:37\n\nAnd. we got our boy Connor O'Malley in the stew. You're sir. Thanks for coming, bro. You're so, yeah. Let him let him know. Dude \n\n0  \n00:00:44\n\nThe devil. Thanks, \n\n1  \n00:00:45\n\nDude. He's, he's here to plug the devil. Dude, \n\n0  \n00:00:47\n\nThe devil's is incredible. \n\n1  \n00:00:50\n\nHe's gotten into the devil big time. These last couple weeks. \n\n0  \n00:00:52\n\nI watched end of day starring Arnold Schwartzenegger. Oh, is \n\n1  \n00:00:55\n\nThat a, is that a devil? \n\n0  \n00:00:56\n\nYou \n\n1  \n00:00:57\n\nRemember that one? I haven't seen that one. \n\n0  \n00:00:58\n\n1999. \n\n1  \n00:00:59\n\nI just watched the one. What's the one where Keanu Reeves is the devil's son? Oh, devil's a devils \n\n0  \n00:01:07\n\nAdvocate. That's, is that what that's about? \n\n1  \n00:01:08\n\nDude, that's a yes. Did I spoil it? Sorry, folks. \n\n0  \n00:01:11\n\nNo, no, I I'm never gonna watch it. No, no, no. \n\n1  \n00:01:13\n\nYou should literally watch it. Seriously. Oh, it's, it's Al Pacino. Al Pacino is, I'm sorry to spoil it again. The devil. It's pretty clear what's \n\n0  \n00:01:22\n\nGoing on in his name. Like, \n\n1  \n00:01:23\n\nLike No, no, no. You're thinking of Angel Heart, where Robert De Niro is a man named Lou Cipher. Yes, yes, \n\n0  \n00:01:29\n\nYes. Imagine how that screenwriter being like, Hmm, \n\n3  \n00:01:34\n\nYes. Lou Cipher. \n\n0  \n00:01:36\n\nLou \n\n1  \n00:01:37\n\nCipher. And they like, don't, it's funny because apparently in the marketing for the movie, they don't give it away. That like, it was like a, it was like a supposed to be a twist, but the guy's name is Lou Cipher, so it's like, it's not exactly like you imagine how dumb you'd have to be to be like, what \n\n0  \n00:01:53\n\nIs that the one where he like, there's a scene with him with the egg? \n\n1  \n00:01:57\n\nI think so. Yeah. I've been meaning to re-Watch that. That's Mickey Rourke. Lisa Bonnet looking outta control. Awesome. Women \n\n0  \n00:02:06\n\nAre beautiful. \n\n1  \n00:02:07\n\nGood stuff. \n\n0  \n00:02:08\n\nWomen are gorgeous. \n\n1  \n00:02:10\n\nThat's my take as well. Lisa Bonnets Wild. I also watched Kimmy, which is Lisa Bonnets daughter. What's her name? Do you guys remember? She's Catwoman Zoe. Catwoman Zoe. Zoe Kravitz. Zoe Kravitz. Really? In really great I mean that movie actually ruled. That's a soderberg. He's the, his \n\n0  \n00:02:29\n\nIs so the brick joint. \n\n1  \n00:02:30\n\nHe's the man. His his like just satisfying quick. I love that. And she is getting railed in part of the movie. So that's a little, you love that. I'm a big thing when a hot girl gets railed in a \n\n0  \n00:02:42\n\nMovie, I say, man, I'm jerk my prick off this shit. \n\n1  \n00:02:44\n\nI really, I didn't 'cause I was on a plane, but I \n\n3  \n00:02:48\n\nYou're \n\n0  \n00:02:49\n\nTaking pictures for later. \n\n3  \n00:02:50\n\nYeah. The flash is going off. Sorry, \n\n0  \n00:02:54\n\nI'm just gonna jerk up to this later. \n\n1  \n00:02:57\n\nI'm a gentleman so I'm not pulling out my hog now, but just know I'm thinking \n\n0  \n00:03:02\n\nAbout That's a good airline. An airline where you can jerk off where you \n\n1  \n00:03:04\n\nCan beat off. Yeah. All \n\n0  \n00:03:05\n\nMale air \n\n1  \n00:03:05\n\nAirline. All male. So that's, so you want, you want the like air, the airplane version of like the steam room at Equinox? Yeah. Yeah. you Know. But it's, yeah, \n\n0  \n00:03:15\n\nAnyone can beat off. It's like \n\n1  \n00:03:17\n\nA completely steam filled cabin. It's not expressly gay, but it wouldn't hurt to be gay. Probably \n\n0  \n00:03:22\n\nLike there's a French airline that's all business class. Mm. This is just that. But it's all business \n\n1  \n00:03:26\n\nClass. This is just all the beat off class you had to wear sweatshirt. Or if there's beat off class where it's like you have, you have, yeah. I mean it would be hard to do that in economy. If, you have those little pods. Yeah, those pods. You could basically beat off it already. \n\n0  \n00:03:42\n\nYeah. The Iliad Pod Iliad beat off pods. The new first class product. Yeah. From \n\n1  \n00:03:47\n\nId. Yeah. The all the like Saudi airlines, \n\n0  \n00:03:51\n\nThey're really, they're genius. Yeah. They're So \n\n1  \n00:03:55\n\nThose guys are awesome, dude. \n\n0  \n00:03:56\n\nDoes, does Greece or Albania have like a propaganda airline? \n\n1  \n00:04:00\n\nWell, it's hilarious to think that Albania would even have an airline. That's number one. \n\n2  \n00:04:05\n\nI think we do. I think I flew it when, when I \n\n1  \n00:04:07\n\nWent there. What was it? What's it called? I think \n\n2  \n00:04:09\n\nIt's called Albania Air or something. \n\n0  \n00:04:12\n\nI mean airplane. \n\n1  \n00:04:14\n\nI don't think, \n\n2  \n00:04:14\n\nI don't think the plane was like branded or anything. Yeah. And it was horrible. And tiny \n\n1  \n00:04:20\n\nAlbania Air baby. \n\n0  \n00:04:21\n\nIt's like Air Lingus. You ever feeling that? \n\n1  \n00:04:23\n\nThat's the Irish shit. Yeah. Which is funny to sound so much like Conal Lingus. Yeah. It \n\n0  \n00:04:28\n\nIs pussy eating airplane. \n\n1  \n00:04:29\n\nYeah. Now we're talking, we got beat off air. We got Air cu Lingus beat Air. I'm gonna start Air cu Lingus and I'm gonna buy the Air Lingus planes. I'm gonna save a lot of money on paint because I'm just gonna add a little \n\n0  \n00:04:42\n\nWell, you gotta paint it from green or from green to pink. From \n\n1  \n00:04:45\n\nGreen to pink. That's true. Fuck. You're right. Yeah. Could be real fucked up. Diseased green pussies. \n\n0  \n00:04:50\n\nIsn't Drake's airplane pink? \n\n1  \n00:04:52\n\nI think it is. \n\n0  \n00:04:54\n\nI think it is. Remember when that video dropped of him showing off his airplane? \n\n1  \n00:04:57\n\nYeah. I don't \n\n0  \n00:04:58\n\nJust being, what the fuck is this? Which I think that was a moment where I was like, why \n\n1  \n00:05:02\n\nDo we make this guy I'm, I'm out on Drake after, oh, it looks like it's blue. Maybe the interior's pink. I don't mean to, I don't mean to you Know expose myself as a class trader. But I did fly on the Puma flight on the Puma jet. On the \n\n0  \n00:05:17\n\nPu jet to, for the Puma island to \n\n1  \n00:05:19\n\nOh yeah, yeah, yeah. I the cat. Yep. Yep. There's \n\n0  \n00:05:24\n\nA Puma jet. \n\n1  \n00:05:25\n\nThere's a Puma jet. Let's, let's explore the Puma Island for a second though. It would be interesting. It would be interesting if there was like, there's a, like there was Epstein Island. If there's one for bestiality Yeah. \n\n0  \n00:05:38\n\nYou fucking cats. \n\n1  \n00:05:39\n\nYou can fuck a, a big cat \n\n0  \n00:05:41\n\nDogs. Yeah. Mr. Hands Island. That \n\n1  \n00:05:43\n\nWould be kind of nice. That would be pretty silly. And you Know what if they had that island? It would obviously we're anti pedophilia islands. And. we are not, that is not our city. Anti, \n\n0  \n00:05:53\n\nNon-consensual in any above age Sex island. \n\n1  \n00:05:56\n\nYeah. Even that, even, even just regular non-consent. We are not into, and just, let's just say even if they're not happening on an island, we're not fans of those two things. Well, okay. On the main, on the mainland. Okay. \n\n0  \n00:06:10\n\nI know the state's. \n\n1  \n00:06:12\n\nRight. I guess, I guess let's not make any blanket statements, but I think Bestiality Island is actually the most, that's actually like a responsible way to handle that Makes the most sense. Yeah. And look, I know \n\n0  \n00:06:25\n\nMadagascar style, which wasn't that Hitler's plan \n\n1  \n00:06:29\n\nWas \n\n0  \n00:06:29\n\nIt? I think he was like, Madagascar will be like our race museum \n\n1  \n00:06:34\n\nWhere we Oh no, he got like a zoo. Yeah. Yeah. Of like Chinese guys and Jews. \n\n0  \n00:06:38\n\nI'm pretty sure that that's \n\n1  \n00:06:39\n\nNow, okay. Did Hitler keep any Jews for the museum? Because that would be interesting. \n\n0  \n00:06:44\n\nThat's an interesting question. I think it's Madagascar plan. \n\n1  \n00:06:48\n\nELSs. Yeah. ELSs, please go ahead and Google. Hitler Jews. There we \n\n0  \n00:06:53\n\nGo. Plan. Oh yeah. Well this is interesting. There, there was like kind of a lib contingency within the Nazi party that was like, let's just give them an island. And then they were also like, they were also like, look, we don't have to kill them. We're just like castrate them. Like they, there was, that was like a big thing. Was like, yeah, \n\n1  \n00:07:14\n\nAll \n\n0  \n00:07:15\n\nWe do that and they can, you know, just kinda live their life out. \n\n1  \n00:07:17\n\nWhatever. You need someone to do the books. Yeah. \n\n0  \n00:07:19\n\nYou Know. \n\n1  \n00:07:20\n\nThey already started when it came to circumcision. Why not keep it going? Finish the \n\n0  \n00:07:24\n\nJob. Finish \n\n1  \n00:07:25\n\nThe job. Cut their whole dick off. Yes. \n\n0  \n00:07:28\n\nI think there's an HBO movie about it. \n\n1  \n00:07:30\n\nOh, \n\n0  \n00:07:30\n\nReally? Yeah. Where it's like them like doing, Hey, we're gonna do the Holocaust. But there is like a contingency of libs. Guys, \n\n1  \n00:07:35\n\nCome on. Come on. \n\n0  \n00:07:36\n\nLike, you know, we gotta you Know. \n\n1  \n00:07:37\n\nYeah, yeah, yeah. We gotta send it to an island like \n\n0  \n00:07:40\n\nThe Pete Buttigieg of the Nazi party. \n\n1  \n00:07:43\n\nThat's \n\n0  \n00:07:43\n\nNot be so \n\n1  \n00:07:44\n\nMean. People are like, we're never getting anything done waffling. you, Know. We gotta, \n\n0  \n00:07:51\n\nAt least they're fucking believing something. Jesus Christ. \n\n1  \n00:07:56\n\nWow. Interesting. I already, that would've been a much better plan already. \n\n0  \n00:07:59\n\nHow, how deep into the podcast. We are. We're already on automatic. \n\n1  \n00:08:01\n\nSeven minutes, \n\n0  \n00:08:03\n\nEight minutes right \n\n1  \n00:08:03\n\nNow. Eight minutes. Nice de monetized. Definitely demonetize. It's historic. It's historic. \n\n0  \n00:08:11\n\nIt's historic. \n\n1  \n00:08:12\n\nWe are against it. Yeah. But the Puma J would, anyway, back to what I was saying, the Puma J was pretty sick. Beyonce flew. 'cause Jay-Z I think either owns Puma or has some kind of like brand deal with them. Okay. So he flies the Puma jet sometimes. So I was on a jet \n\n0  \n00:08:31\n\nWith Jay-Z. \n\n1  \n00:08:32\n\nNo, no, no. But I use the same toilet. Beyonce's ass cheeks were probably on. That's pretty fucking cool. That \n\n0  \n00:08:38\n\nIs the thing, man. When you're watching porn, these people shit and piss outta these things. \n\n1  \n00:08:45\n\nThat \n\n0  \n00:08:46\n\nIs true. A beautiful ass If. you had diarrhea. \n\n1  \n00:08:50\n\nYeah, that is true. That's a messed up way to go about it. Where do you think the best if, if you're, God, you could start all over. Okay. \n\n0  \n00:09:00\n\nIf I'm about what? \n\n1  \n00:09:01\n\nIf you're, God. God. \n\n0  \n00:09:02\n\nOkay. \n\n1  \n00:09:02\n\nOkay. Now do you shit. Like, 'cause we all want here. We all like a big ass. you Know, we'd like to see it, we'd like to fuck it, et cetera. Now do, so do you make it so that you Know what? Actually, I think I have an answer. Maybe you shit outta the bottom of your foot. \n\n0  \n00:09:18\n\nOkay. \n\n1  \n00:09:18\n\nAnd the ass is purely for fucking, and the puss. Well, well now what do we do with the pussy? Do baby still come outta the pussy? \n\n0  \n00:09:24\n\nI think pussy and penis stick around. Okay. Piss, piss still coming out of it. Although we figure out something for, \n\n1  \n00:09:30\n\nBecause then you lose squirting if piss goes. Yeah, we gotta keep squirting around. \n\n0  \n00:09:34\n\nBut I'll say slipping and slide. Yeah. But I say we, we seal up the asshole, seal up the hole, and then like in kind of, we get rid of one of the kidneys. Okay. And where the kidneys is, there's a cassette, like, kind of like you Know how in some RVs there's like a cassette \n\n1  \n00:09:49\n\nFor the Yep. \n\n0  \n00:09:50\n\nFor the waste. You can remove it from the RV and take it to \n\n1  \n00:09:54\n\nPump it out. Oh, interesting. \n\n0  \n00:09:55\n\nSo you kind of are filling up \n\n1  \n00:09:56\n\nThis. It's \n\n0  \n00:09:57\n\nA bag. It's like a colostomy bag. And you can take it out and kind of unzip it, dump it into something, put it back in. So you're not like If, you have diarrhea. It doesn't matter. If, you, you are constipated. It doesn't matter \n\n1  \n00:10:08\n\nNow. But what if it gets too full? You shit just starts, \n\n0  \n00:10:11\n\nYou start puking shit. Oh, you start \n\n1  \n00:10:12\n\nPuking. See, that's a prob big problem. Spewing. That's a big problem of your design. \n\n0  \n00:10:19\n\nI had the worst. I had fucking straight up dysentery for like months. \n\n1  \n00:10:23\n\nOh, where? How did it happen? \n\n0  \n00:10:24\n\nIn England. Wow. I was doing shows in England and Ireland. \n\n1  \n00:10:28\n\nDamn, you were there for a while too. \n\n0  \n00:10:30\n\nI like was coming back and forth. It was so stupid. Yeah. \n\n1  \n00:10:33\n\nWhy did you do that? I don't know. \n\n0  \n00:10:36\n\nI didn't, I want to, I wanted to vote in a primary. \n\n1  \n00:10:40\n\nWow. Who's the lib now? Who's backing the Madagascar plan Now? You \n\n0  \n00:10:44\n\nLiterally don't know who I was voting for and why. \n\n1  \n00:10:47\n\nThat's true. You got me there. You were writing in Alex Jones. \n\n0  \n00:10:54\n\nBut I had, I was, it was the first time I had diarrhea on an airplane. \n\n1  \n00:10:57\n\nWow. How was that? Dude, \n\n0  \n00:10:59\n\nIt was so bad. \n\n1  \n00:11:00\n\nYeah. Imagine getting that on Albania Air ELSs. You're done. \n\n2  \n00:11:04\n\nI don't even remember if there was a bathroom on there or not. There had to be. \n\n1  \n00:11:09\n\nThat's so \n\n2  \n00:11:10\n\nIt, it was a short flight, so I didn't have to check. But if it \n\n0  \n00:11:13\n\nWas, it was a bleach bottle. \n\n2  \n00:11:15\n\nYeah. Yeah. It was like a bucket in the cockpit. You have to open the door. Be like, excuse me, excuse \n\n1  \n00:11:22\n\nMe, pilot. \n\n2  \n00:11:24\n\nI gotta take a shit. \n\n1  \n00:11:26\n\nThe co-pilot gets up from the bucket, takes him, he's sitting on a plank, the bucket with a plank over it. He picks, picks the plank up you shit in it. He's like, make it quick. We're landing soon. Damn, dude. Was it fish? Was it, was it bad English food or what? \n\n0  \n00:11:42\n\nIt was something I ate in New York. Oh. Instantly I shit my pants before I left for America at home. And then just like the worst. Just like, and it would like go away for a couple days. And I think, okay, I think I'm normal. And then I would shit myself. It was like so bad. I don't know what it was. \n\n1  \n00:12:00\n\nLike your pan, you would shit your pants. Yeah. \n\n0  \n00:12:02\n\nI'd be like out. I'm like, I shit myself. I gotta go back to a hotel. I couldn't like eat anything. I like lost like 15 pounds. Put it all back on. Oh. But it was horrible. And then, and then when my shit returned, it was like pale. \n\n1  \n00:12:16\n\nInteresting. \n\n0  \n00:12:16\n\nIt was like this pale clay. And it was just like yellow \n\n1  \n00:12:21\n\nOr pale. \n\n0  \n00:12:22\n\nIt looked like sand, like pale sand. \n\n1  \n00:12:26\n\nWow. Like someone had filled your ass with Play-Doh. \n\n0  \n00:12:29\n\nSomebody filled my ass with Play-Doh. And it was just so I was like, I'm, I'm dead. I'm done. Could \n\n1  \n00:12:36\n\nYou eat anything? Like, was your stomach on the rocks for a while? \n\n0  \n00:12:38\n\nI could only like only eat cereal. \n\n1  \n00:12:40\n\nWow. Dude. \n\n0  \n00:12:40\n\nIt was so, and like I had to do like a week of shows in London that were, those shows were going bad. And I was like \n\n1  \n00:12:49\n\nBombing. Bombing and constantly possibly shitting yourself. \n\n0  \n00:12:53\n\nSo like, bomb. The only thing I could eat was Prett And. I was like, I'd eat like a Prett sandwich and then immediately shit it out. And then I'm on stage shaking like I'm gonna shit myself. This like, British audience hates me. The show has like straight up porn in it. Like \n\n1  \n00:13:09\n\nThey \n\n0  \n00:13:10\n\nCan't stand It. \n\n1  \n00:13:11\n\nDid you get written up? Like the way they always, 'cause England still has like culture. Yeah. And so they'll send like a somebody to write up every comedy show. Did you get like a weird writeup? \n\n0  \n00:13:21\n\nIt was, yeah. I got like tons of bad reviews. \n\n1  \n00:13:24\n\nLet's fucking pull one up. Elvis \n\n0  \n00:13:27\n\nAll the, but all the reviews aren't even like that fun. Yeah, yeah, yeah. They're like kind of like, yeah. Injecting stupidity and you know, \n\n1  \n00:13:40\n\nIt's \n\n0  \n00:13:40\n\nJust like they don't get stupid shit. \n\n1  \n00:13:42\n\nYeah. No. They're \n\n0  \n00:13:44\n\nSo \n\n1  \n00:13:44\n\nSore up their own ass. They're like, put it on a dress. Put on a dress and dance. Funny. They \n\n0  \n00:13:49\n\nLove Yeah. \n\n1  \n00:13:50\n\nFuck. yeah. I mean. No, no. Whatever. It doesn't matter. I've already lost interest El this, you're minus one producer point for not Googling it fast enough. I don't \n\n0  \n00:14:00\n\nEven know what, like what is the, what do they think is good? Like what is their favorite thing? \n\n1  \n00:14:05\n\nI don't know. Yeah. I mean British comedy sucks. Dick, if anybody I'm funny. Some \n\n0  \n00:14:11\n\nOf it's really good. \n\n1  \n00:14:13\n\nI, yeah. I guess I know, \n\n0  \n00:14:15\n\nBut I mean, I, I feel like there's, \n\n1  \n00:14:18\n\nThere's definitely a couple bangers. Don't get me wrong. I guess I just feel like I feel this way about England and Australia. It's like, you can be like, you could get famous there pretty easy and no one really gives a fuck. Like, it doesn't matter that much. Like, I remember when we went, when we, I think I've told this story before, but like when we did, we did like a come down tour is up in Australia. Nice dude. That's awesome. We did a come down tour in Australia and like the guys, like the comics on the sh like just on bar shows with us. Were like, you Know, they were bad. you Know. Like, they were like, maybe a couple were okay, but they were all doing like goofy, absurd bullshit that there's no punchlines. \n\n1  \n00:14:59\n\nAnd, and I'd be like, oh, that guy was whatever. And then you just turn on the TV and he's just like, in a movie, you Know what I mean? It's like's like, he's like an ama and it's like, it doesn't really matter. There's a couple good comics obviously, but I just have, like, I have, I definitely have American, I have American supremacy. When it comes to standup comedy, there's no way. There's \n\n0  \n00:15:19\n\nJust sometimes there's kind of a unwillingness to be stupid. But there are a lot of I know, like I'm friends with a lot of like British comedians that are like, I'm very stupid. I'm open to being \n\n1  \n00:15:31\n\nStupid. Nice. \n\n0  \n00:15:32\n\nAnd it's like, really? They're very funny. Yeah. But there's, I think maybe it's kind of the influence of the footlights, which is like their lampoon. Mm. \n\n1  \n00:15:41\n\nThat sucks. \n\n0  \n00:15:42\n\nAnd like, I don't know, Ireland, I feel like they have funny people in Ireland. \n\n1  \n00:15:46\n\nIreland I'm more open to. Yeah. 'cause they're, it's a, it's a better country. Yeah. I fuck with them. Fuck I mean England can just suck my dick in general. \n\n0  \n00:15:55\n\nI mean basically you go anywhere in the world. Everyone's feeling that way. Right. \n\n1  \n00:15:58\n\nNobody about England. Yeah. Yeah. It's funny to like, to be like you Know England is like, oh, we defeated the Nazi. you Know. We were, we're part of like the people. Well you know what I mean? They're part of the whole, they're part of the good guys. And then just like ask half of the world who's worst Britain or the Nazis? No, they are taking England. Yeah. Like they're like, like you go to India, you Know, \n\n0  \n00:16:22\n\nThey already got the s they stole the swastika from \n\n1  \n00:16:25\n\nYeah. First of all, you take our swastika. It's like, alright. That's kind of big ups to us. You're kind of cosigning us representation. Yeah. \n\n0  \n00:16:31\n\nLike anytime, anytime there's a movie set in Chicago. Yeah. And my family would always rent it. Yeah. Like no matter what it \n\n1  \n00:16:37\n\nWas, they're like, this is awesome. Yeah. We don't agree with what you're up to. But, but yeah. It's like, like you watch Rrr, we fuck R Rrr rules. You seen Rrrrrrr? No. \n\n0  \n00:16:46\n\nWhat is this \n\n1  \n00:16:47\n\nAwesome movie? Awesome movie. It's like rrr r It's not Bollywood, but it's like a separate production city of like a separate, like in India. And it's just this incredible and like War E, like war epic about these guys that are basically, basically like telling the Eng England to go fuck themselves. And it's like in that movie they, the British are Nazis straight up. Like there's no way around it. Yeah. Yeah. And in India, which is like insanely, most people just like, yeah, fuck England. Yeah. So anyway, I, my \n\n0  \n00:17:20\n\nDecade, well the, the Nazis were like, they like Hitler would always be like, I, he called like the British their cousins. He was always like, I wish that they would. It's like documentary. He's like, I wish that they would just like join us. And he like made a made offer like through the royal family. Like that one guy that abdicated, he was like, you'll be king. \n\n1  \n00:17:39\n\nOh yeah. That guy was n that guy was kind of a Nazi. That's \n\n0  \n00:17:42\n\nRight. And they were kind of like, I mean they shared all the same ideas. Yeah. Eugenics and shit like that. Totally. Which, so did they hear in the us? Yeah, yeah. Yeah. Even like, there was a bunch of like Irish revolutionaries that were like slightly aligned with the Nazis. Interesting. Because they were like, yeah, like we will take over And. we like, we'll give you guys your own country. We get \n\n1  \n00:18:00\n\nYeah, yeah, yeah, yeah. Oh, interesting. But they really overplayed their hand with the whole you Know exterminating the Jews thing. Because if they just \n\n0  \n00:18:08\n\nDidn't \n\n1  \n00:18:09\n\nDo \n\n0  \n00:18:09\n\nThat, \n\n1  \n00:18:09\n\nIf there was one thing they fucked up. Yeah. If they had gone Madagascar plan, we might be fucking speaking Kerman bro. We might be speaking Kerman. And honestly, Madagascar might be a fun little vacation spot. \n\n0  \n00:18:20\n\nI mean you Know what? The movie's good. Yeah. Yeah, yeah. \n\n1  \n00:18:23\n\nI wonder that. Imagine how funnier Madagascar the movie would be if just a bunch of Jews were writing it. Dude, a bunch of the best comedy writers living on that island coming up with fun little hijinks. Wow. We'll never know. No. Yeah. I was supposed to go to England and then I just did not go. I don't have a good thing. I don't have a good reason. But I was, I was kind of looking forward to getting one of those like cty reviews from like some posh guy. Yeah, I think so. Yeah. I think so. But I also want to go and I wanna go steal back all the Greek statues. Those fucking cos \n\n0  \n00:18:57\n\nStuff. Oh yeah. They fucked you guys over bad, didn't they? \n\n1  \n00:18:59\n\nDude, fuck England. Truly. And the other is even like all the like four, all the like kings and shit. They're all, they were all cousins. Like, they were all like, so we got like a Kerman king that England gave us after. Yeah. They were all fucking after the revolution. They were like, we're gonna put one of our dumb ass cousins in charge of your Don't worry fucking country. Don't worry, don't worry. Yeah. And Prince Philip was born in Greece. The guy who fucked, who fucked the queen and made Charles and all those ugly motherfuckers \n\n0  \n00:19:27\n\nFuck the queen and made Charles \n\n1  \n00:19:32\n\nAnd that one pedophile. \n\n0  \n00:19:33\n\nYeah. He fucked the queen and made Charles. \n\n1  \n00:19:35\n\nYeah. So technically he, you know, he's, he claims to be Greek. That's that guy's not Greek. He's a Kerman fucking piece of shit. Piece \n\n0  \n00:19:42\n\nOf shit. \n\n1  \n00:19:43\n\nAristo aristocrat. And they can all suck my dick. \n\n0  \n00:19:47\n\nYeah. I'm only for here for trash people, \n\n1  \n00:19:49\n\nDude. Hell. yeah. Let's fucking trash the dead. The dead royal family. But it was, you know, whatever. Maybe say, listen, sorry, England, maybe I'll come by sometime. Maybe I'll come by. Check it out. Have \n\n0  \n00:20:00\n\nYou done Ireland or Scotland? I \n\n1  \n00:20:02\n\nHaven't done any of that stuff. Dude. \n\n0  \n00:20:03\n\nI think you'd really like I Ireland's Cool. \n\n1  \n00:20:05\n\nI wanna go to, I do want to go to Ireland. Are you, you're ethnically You're not from any of that shit, are you? \n\n0  \n00:20:10\n\nOr what do you I got citizenship. You \n\n1  \n00:20:12\n\nGot citizenship? Yeah. Yeah. Get the fuck outta \n\n0  \n00:20:13\n\nHere. Here. Desperate for citizens. Really? So If you can trace back just \n\n1  \n00:20:16\n\n'cause O'Malley. \n\n0  \n00:20:18\n\nYeah. Well my, yeah, you \n\n1  \n00:20:20\n\nJust show up and like, yeah, sure. \n\n0  \n00:20:21\n\nHere you go. Here's the passport. Whatever. My grandparents were from there. \n\n1  \n00:20:27\n\nOh, grandparents. Okay. So you actually can trace it. Yeah. Yeah. Pretty recently. Do do either of your parents have like a fucking even hint of an accent? \n\n0  \n00:20:35\n\nNot really. But like when I was over there recently, I was like talking to, I was doing shows and asking all the comedians, like the main thing I felt connected with 'em was like, did your parents hit you? And they're like, yeah, yeah. Like everybody. It's like, yeah, me too. \n\n1  \n00:20:50\n\nEverybody gave her a little wax. \n\n0  \n00:20:52\n\nIt's like, okay, that's, that's culturally I feel \n\n1  \n00:20:54\n\nConnected. Of course you could. Yeah. That, that's now I'm in the motherland. \n\n0  \n00:20:57\n\nDeep shame. \n\n1  \n00:20:59\n\nOh yeah. \n\n0  \n00:20:59\n\nJust feeling guilty 24 7 all the time no matter what. Waking up, just being like, everybody hates me. Yeah. They all feel that too. \n\n1  \n00:21:08\n\nThat's awesome dude. Yeah. You're connect. Were both your parents Irish or just on one side? Dad's side. I guess the, \n\n0  \n00:21:15\n\nMy, yeah. My dad and then my grandma was English. Mm. \n\n1  \n00:21:20\n\nFrom Oh damn bro. \n\n0  \n00:21:21\n\nShe fucked my grandpa who came over and wanted to get his dick wet during World War ii. \n\n1  \n00:21:30\n\nAnd she \n\n0  \n00:21:31\n\nSaid Sure. \n\n1  \n00:21:32\n\nYeah. Hell. yeah. She had \n\n0  \n00:21:33\n\nSex with him. Nice. For a plane ticket back to \n\n1  \n00:21:36\n\nThese whores will fuck for whatever theses will fuck for an economy seat they \n\n0  \n00:21:40\n\nOwe \n\n1  \n00:21:41\n\nBack, back to the USA less. \n\n0  \n00:21:44\n\nYeah. Like \n\n1  \n00:21:44\n\nYou think she was on a boat? Maybe. You think you sent her on a boat? Dude, this is World War \n\n0  \n00:21:48\n\nIi. Yeah. You took the boat. I took the \n\n1  \n00:21:49\n\nPlane. She fucked for the boat. Yeah, she \n\n0  \n00:21:51\n\nDid fuck for a boat. Oh my God. \n\n1  \n00:21:54\n\nBut not even like a yacht. We're talking, they had this bitch coming over with like, you know, lambs and potatoes and lambs and like \n\n0  \n00:22:01\n\nBig \n\n1  \n00:22:02\n\nSax iron ore. \n\n0  \n00:22:04\n\nShe had to be pulled out by a rope, like, like in Hell's Kitchen. \n\n1  \n00:22:11\n\nAnd they, so they, but then your family's from, you grew up in Chicago, right? \n\n0  \n00:22:14\n\nInto City \n\n1  \n00:22:15\n\nFuck. yeah. Dude. So they must've came. They came Ellis Island. Straight to Chicago. \n\n0  \n00:22:19\n\nStraight to Chicago. We want to go where the beefs are. Yeah. Dude. Where the pizza is \n\n1  \n00:22:24\n\nSo fucking, \n\n0  \n00:22:25\n\nI don't know why they came here. \n\n1  \n00:22:27\n\nWe \n\n0  \n00:22:28\n\nHave like weird family all over the place. Like, I did a show in in Pittsburgh and my dad was like, oh yeah, you have a, we have family over there. I remember one time my dad drove to Pittsburgh 'cause his brother was blinded in the steel mill. Like something happened where he like got blinded and he like drove overnight to Pittsburgh to see him. \n\n1  \n00:22:47\n\nHe's like, Hey man, sucks. \n\n0  \n00:22:50\n\nSorry dude. That \n\n1  \n00:22:51\n\nSucks, dude. All right. I got a 14 hour drive back. \n\n0  \n00:22:56\n\nI gotta be up in the morning. I just wanted to, oh shit. I could've called you, but \n\n1  \n00:23:01\n\nYeah, I guess you can't really see me. Huh? \n\n0  \n00:23:05\n\nBut you're full, your parents Greek. \n\n1  \n00:23:07\n\nFull Greek baby. Full Greek And. we got a little, we got just a little hitting. Not too much. Just a little sprinkle. My grandma, my grandma lived with us straight. you Know. Straight from the straight from the old country. She would threaten you to hit you with a, with a her shoe. \n\n0  \n00:23:23\n\nOkay. Or \n\n1  \n00:23:24\n\nHer like switch. She had a switch that she claimed. She claimed she had the magic switch that would come from grease to fuck us up. But she only very lightly hit us. And then our parents, my parents tried to hit us a couple times, but it just didn't work. And then my dad had a huge anger problem. So a couple times my boy under the guise of parenting would just, you Know Know beat the fuck outta you. \n\n0  \n00:23:47\n\nYou need it. I do think that there is like a distinct difference between people who got hit growing \n\n1  \n00:23:52\n\nUp. Yeah. And people you're feel like I'm friends with You're beat yo kids. Yeah. You beat you're beat, beat your goddamn kids. You have to do it's next special. You really beat o kids. \n\n0  \n00:24:04\n\nAnd it's me beating a child. Yeah. \n\n1  \n00:24:05\n\nThat's not mine. Bring up your misbehaving children. You just wallop them. \n\n0  \n00:24:10\n\nDid you ever, I remember once my neighbor, they had like a, a nanny and the na we were over. Me and my brother were hanging out and the nanny hit me and then the nanny like went and told my mom like he was, he was misbehaving. So I hit him and my mom was like, Thank you for hitting him. \n\n1  \n00:24:29\n\nIt's really good. Yeah. Like, yeah, like in the fifties, If, you were in a Macy's and some kid was running around. You could just be like, and then their dad would shake your hand and buy you a fucking a, a root beer Float first for doing that. Alice, did you ever get the hands put on you? Man, \n\n2  \n00:24:45\n\nMy mom tried it one time. But I was like in middle school. You were a big fucker. I was already the big as fuck by then. Yeah. We, it, it was good. 'cause we just kind of both started laughing. We're like, this just doesn't feel right. \n\n0  \n00:24:57\n\nMy dad were like, \n\n2  \n00:24:58\n\nThat's not \n\n1  \n00:24:58\n\nA good, your dad never, your dad was probably too checked out to even hit. \n\n2  \n00:25:03\n\nHe never No, \n\n1  \n00:25:04\n\nHe never, yeah, \n\n2  \n00:25:05\n\nHe threw, he threw tantrums and Yeah. you Know would yell way too loud. Of course the TV's annoying him, but, but never, never anything physical. \n\n1  \n00:25:16\n\nBut he would never square up. No. Yeah. That makes sense. My dad \n\n0  \n00:25:20\n\nPhysically, like in high school, like fist fought both of my brothers multiple times and lost each time. \n\n1  \n00:25:29\n\nThat's fucking awesome. To lose once and then be like, all right, I gotta, I got, I gotta get back in here. \n\n0  \n00:25:35\n\nHere. And he started all the fight too. So he started them. Like, I remember just like waking up to my oldest brother being like, you done, you done. And like, I open up my bedroom door and he's like, got pinned. \n\n1  \n00:25:48\n\nFuck. yeah. Fuck. yeah. \n\n0  \n00:25:52\n\nAnd then he squared up with me in high school, but his back was too fucked up. And I was like, \n\n1  \n00:25:57\n\nLike, no man, can't do it. I'm not putting you in the hospital. The fist fight's awesome. \n\n0  \n00:26:02\n\nIt's so \n\n1  \n00:26:03\n\nGood. That's such a wild move. \n\n0  \n00:26:04\n\nYou really need to, you really need to fist fight your sons. \n\n1  \n00:26:07\n\nYeah. That's the passing of the torch. Yeah. When you can finally win the fight. Now Dad has to listen to you now he has to be. Yeah. And now you're equals. Yeah, because was your dad, 'cause you were, you were a big boy, right? You were Fat as shit. Ba as a youth. \n\n0  \n00:26:21\n\nOh yeah. Obese. OB was \n\n1  \n00:26:22\n\nThe whole family. Fat as shit. \n\n0  \n00:26:23\n\nWe are a large family. That's \n\n1  \n00:26:24\n\nAwesome, dude. A nice Chicago. Yeah. Yeah. Couple that true \n\n0  \n00:26:27\n\nThat extra. A large family. \n\n1  \n00:26:30\n\nYeah. So those, those were, those were heavyweight bouts, then \n\n0  \n00:26:32\n\nHeavyweight bouts. Big, big family. Still kind of big. \n\n1  \n00:26:38\n\nYeah. Hell. \n\n0  \n00:26:39\n\nYeah. One time I, I was, when I was like 20, I just like, like maybe I'm not going eat four burgers every day. \n\n1  \n00:26:48\n\nAnd \n\n0  \n00:26:48\n\nThen I just was like, kind of like, all right, I'll have like chicken instead. Yeah. And I. Like immediately like lost all the weight. That's \n\n1  \n00:26:56\n\nHilarious. \n\n0  \n00:26:56\n\nAnd like, it happened kind of fast. 'cause I was like, you know, 19, 20. Yeah, yeah, yeah. And then we had a family reunion. And I. Did I, I showed up late. And I had like, my extended family hadn't seen me in a while and my brothers told all my cousins that I had aids. So I showed up and all my like, my like weird like firefighter cousins are like, you all right man. \n\n1  \n00:27:27\n\nI love the idea that you Know okay. In your family, it's more plausible that you have aids then you just ate a couple salads. \n\n0  \n00:27:35\n\nYeah. He's got aids. \n\n1  \n00:27:36\n\nWell, everyone's Fat as shit. Unless, so they get some kind of horrible virus in this family that's fucking sick. He's got AIDS and they believed it. \n\n0  \n00:27:45\n\nThey, well, I I think they targeted like a few cousins. \n\n1  \n00:27:48\n\nYes. The gullible ones. And \n\n0  \n00:27:49\n\nThey, they believed it. Not even gullible, just like the ones they didn't like. Mm. And then And I had to give it up. Like, it's like, that's really funny. That is \n\n1  \n00:27:57\n\nReally, it's really, really good. Were people weird around you? \n\n0  \n00:28:00\n\nThe 1 1 1 cousin was like, Hey man, doing okay. Like, yeah, fine. Yeah. You look good. Like, oh, thanks man. \n\n1  \n00:28:07\n\nYeah. Doing awesome man. \n\n0  \n00:28:09\n\nAnd it was also in the basement of a Holiday Inn by a \n\n1  \n00:28:12\n\nAirport. Oh yeah. Just like the \n\n0  \n00:28:13\n\nLocation. \n\n1  \n00:28:14\n\nThat's insane. So they would have like, it wasn't at someone's house. It was at the fucking, \n\n0  \n00:28:18\n\nIt was at like a Holiday Inn. Yeah. Damn. It would either be like at the Park District or like, we know somebody that manages this hotel. Jesus Christ flies. \n\n1  \n00:28:26\n\nYeah. Sorry man. We got some flies on deck. That's fucking hilarious, dude. That we, that because the family reunion, I'm only, I only really know of the family of union as a black phenomenon in like a park. And there's a cookout involved Irish. Yeah, yeah, yeah, yeah. Yeah. You \n\n0  \n00:28:41\n\nSlaves too. you Know Biden's reversing the whiteness for Irish. \n\n1  \n00:28:43\n\nOh, I didn't know that. Yeah. \n\n0  \n00:28:44\n\nWe're going back to knocking \n\n1  \n00:28:45\n\nWhite. You're going back to you. Isn't he Irish? \n\n0  \n00:28:48\n\nThat's why he did. Oh. \n\n1  \n00:28:49\n\n'cause he wants, \n\n0  \n00:28:49\n\nBecause he wants to say \n\n1  \n00:28:51\n\nHe wants, he wants to say it. \n\n0  \n00:28:53\n\nWants to say \n\n1  \n00:28:53\n\nIt. We're going back. Yeah. Listen, Obama was my boss for fucking 16 years. I'm gonna say it once. I had to think it for two administrations in a row \n\n0  \n00:29:04\n\nSaying Obama was my boss Is really funny. Is like picture, like he works at a construction \n\n1  \n00:29:11\n\nCompany. Fuck. Obama was his fucking bo I guess he was his eight years I know why I said, I thought for a second. I was like, I guess a presidential term is eight years, but that's not right. It's four. But shout out to Joey B. Yeah. Dude. I, I, yeah. I've never, I've never, the idea of having like a family reunion in a fucking, in a shitty ballroom, in a shitty hotel was so \n\n0  \n00:29:33\n\nFunny. It was even a, it was like \n\n1  \n00:29:35\n\nThe conference room. Yeah. Hell. \n\n0  \n00:29:37\n\nYeah. And it was like a weird, it was an off year for, for that. We usually would do like the park district. Nice. Which would just be like a gym. Yeah. With like folding tables and a macho and then like, pop. \n\n1  \n00:29:52\n\nThat's fucking sick. Are you the old, what do you, where you in the brother hierarchy \n\n0  \n00:29:56\n\nAnd the youngest. \n\n1  \n00:29:57\n\nYoungest. Oh, the baby boy. You \n\n0  \n00:29:59\n\nGot \n\n1  \n00:29:59\n\nBrothers right? I got two brothers. Two. I got, I'm the oldest. I have two twin brothers. They're fraternal twins. Oh my God. But I'm the only Fat one, so that doesn't really Yeah. I'm the only Fat brother. \n\n0  \n00:30:09\n\nThere's a little bit of an inverse for us. \n\n1  \n00:30:10\n\nYeah, yeah. Yes. Exactly. I'm the oldest fattest one. You're the youngest thin one. Yeah. What, so what, what does your parents do? Like what were they out, what were they out in Chicago. \n\n0  \n00:30:22\n\nMy dad was an elevator mechanic. Hell? yeah. And my brothers are too. \n\n1  \n00:30:26\n\nOh, Fuck. yeah. I'm the only one who's out. Is that a good union job? \n\n0  \n00:30:29\n\nIt's a really good gig. 'cause \n\n1  \n00:30:31\n\nIt's anybody autistic in the family. That's a, that's an autistic guy's dream. \n\n0  \n00:30:35\n\nWent to Ireland. We like met like a, like other autistic on each side. \n\n1  \n00:30:39\n\nAll \n\n0  \n00:30:40\n\nAll of them. Yeah. \n\n1  \n00:30:41\n\nThere's a reason you guys are such good elevator mechanics. \n\n0  \n00:30:43\n\nAnd there's one that was like really short that didn't, that would just smile. And my cousin who's like would go every, each year Yeah. Who like, felt bad and she was like, oh, when you guys leave she won't stop talking about you. She loves \n\n1  \n00:30:57\n\nYou guys. And she's going, yeah, yeah, yeah. But it's like, ah, \n\n0  \n00:31:00\n\nI \n\n1  \n00:31:01\n\nKnow about that. Didn't, she didn't feel that way. She \n\n0  \n00:31:03\n\nDidn't feel It's okay. She doesn't have to. Yeah. They're all my brother Sean. He's a, he's a fan of the show. Shout \n\n1  \n00:31:09\n\nOut to Sean. Sean O'Malley. Shout out to oh dude. Fat elevator mechanic named Sean O'Malley. Yeah. That's one of the k that's a king right there. \n\n0  \n00:31:16\n\nHe's not Fat anymore. He's he's come down. Oh \n\n1  \n00:31:18\n\nShit. A traitor. Fuck you Shawn. I thought we had something special. Dude, you've abandoned me. So the other one's Fat though. We got one O'Malley brother Fat as shit, or no, \n\n0  \n00:31:28\n\nI mean I'm, I feel like I'm you Know in New York. I'm Fat. Yeah, yeah, yeah. In LA and LA I'm like, they they'll shoot me. \n\n1  \n00:31:36\n\nPut me down. Yeah. Oh, for sure. In LA you're only allowed to be Fat if it's like, you could be played. It's funny if on camera you falling down is a big laugh in a, in a shitty movie. We're \n\n0  \n00:31:47\n\nLike, I feel like in Ohio, I'm like the first person. \n\n1  \n00:31:49\n\nOh, you're the sexiest guy of all time. \n\n0  \n00:31:51\n\nAnd like, same thing in Chicago too. \n\n1  \n00:31:53\n\nOh. And Chi dude. I love Chicago for that reason. Yeah. 'cause it's just, it's the Fat man's paradise. Like, like the idea that you go into a thrift store. And I was like, people were as Fat as me 30 years ago in this city. \n\n0  \n00:32:06\n\nIt's like, yeah. Just Fat Guy City. It's \n\n1  \n00:32:08\n\nFucking awesome. \n\n0  \n00:32:09\n\nHave you been to Milwaukee? \n\n1  \n00:32:10\n\nYeah. I love \n\n0  \n00:32:11\n\nMilwaukee. I feel like Milwaukee is even more \n\n1  \n00:32:13\n\nThis love Milwaukee. Yeah, yeah. Yeah. Chicago's enough. 'cause it's like, it's, it is like, it's kind of just like the Fat New York, right? Yeah. 'cause it's still the big, it's still big city. It's very metropolitan, whatever. Yeah. But Milwaukee's just pure. You take, you take all that light, you take the museums. Do \n\n0  \n00:32:30\n\nYou have the butter burger there? \n\n1  \n00:32:31\n\nThe butter? I have not had the butter \n\n0  \n00:32:33\n\nBurger. So's go down to so's have the butter burger. \n\n1  \n00:32:35\n\nWe're there this year. We're there we're later in \n\n0  \n00:32:38\n\nA couple months. They put a half, they put a half stick of butter on a cheeseburger \n\n1  \n00:32:41\n\nJust \n\n0  \n00:32:41\n\nOn it. And it's disgusting \n\n1  \n00:32:43\n\nThat, that's crazy. That something is too Fat for me. Theoretically. \n\n0  \n00:32:47\n\nIt's I mean. I hear that I mean you'll be, you'll be shown something. Yeah. You'll be challenged in Milwaukee. \n\n1  \n00:32:52\n\nWow. Dude. \n\n0  \n00:32:53\n\nThey, they go wow. \n\n1  \n00:32:55\n\nSo hard. That's the Fat crucible right there. \n\n0  \n00:32:57\n\nI also feel like Chicago, like, I feel like everywhere in the Midwest has like a dish that was designed for people to eat like once in the morning and then they go into a factory for 12 hours. Yeah, yeah, yeah. Don't you don't stop. You \n\n1  \n00:33:11\n\nDon't, you do not stop. Here's \n\n0  \n00:33:12\n\nLike a, like a 1500, 2000 calorie meal in one city. \n\n1  \n00:33:16\n\nYes, yes. Yes. \n\n0  \n00:33:16\n\nIt's full of like Fat. \n\n1  \n00:33:18\n\nIt's dense as Fuck. yeah. \n\n0  \n00:33:19\n\nRust belt happened. De-industrialization happened. Now it's like this sandwich is our identity. Yeah, \n\n1  \n00:33:24\n\nYeah, yeah. \n\n0  \n00:33:25\n\nThis is our industry. We have to like, push this forward. Or like beef cured like salami sandwich. Yeah, yeah, \n\n1  \n00:33:32\n\nYeah, yeah. \n\n0  \n00:33:33\n\nThat's microwaved with cheese on top. Yeah. \n\n1  \n00:33:35\n\nYeah. Yeah. It's disgusting. Yeah. Yeah. Yeah. And I feel like Chicago hollow out a baguette. Put, put as many sausages as will fit in there. Hollow \n\n0  \n00:33:42\n\nOut with your penis. \n\n1  \n00:33:46\n\nOoh, that's not bad. Yeah. I, Greek I mean like, Greek fishermen would eat, like for breakfast we just have like a, like a, a little bread and a little fish and like a glass of olive oil as like stay out all day. 'cause the Fat keeps you And like, imagine trying to like, \n\n0  \n00:34:05\n\nBut I feel like Mediterranean food is like so good for you, right? \n\n1  \n00:34:07\n\nYeah. No, it's good. Like it's good. I I was on vacation And. we were going fucking crazy. Right? Like, we were just like not watching what And I I somehow like was in better shape than just my regular life. Because it's just like you Know Greek salads. A little fried little, yeah. A little fried squid. A little fucking little grilled. Everything's grilled. \n\n0  \n00:34:28\n\nYou don't taste great. \n\n1  \n00:34:30\n\nIt's incredible, dude. And it's not deep fried. It's like if it anything's fried, it's like shallow fried and like some olive oil that's just, that's fresh. It's not like, you know the shit. You have wings. Shit that gets like wings get cooked in here. Yeah, yeah, yeah. God knows how long that oil's been fucking out and about. Dude. That's what's also about like Chinese food oil. You're like, Hmm. This is like 12 different meats. Yeah. In that's really good. In these chicken wings. Those taste fucking awesome. Have \n\n0  \n00:34:57\n\nYou ever hit this zone of fatness where like, like I just can't not have fries. Like \n\n1  \n00:35:03\n\nOh yeah. Oh yeah. Or like, \n\n0  \n00:35:05\n\nOr like I can't drink water. It's boring. Yeah, \n\n1  \n00:35:07\n\nYeah, yeah. Yeah. Dude. \n\n0  \n00:35:09\n\nAbsolutely. You've desensitized. It's like watching too much porn. If. you completely desensitized. You're like \n\n1  \n00:35:13\n\nA hundred percent You have to watch like somebody, there's a gun inside in a woman's mouth. \n\n0  \n00:35:18\n\nYou have? Yeah. You have \n\n1  \n00:35:19\n\nTo watch like three. you Know the guy cut his dick off and his fucking her with it. You're like, yeah, now we're talking. Yeah. Just get up in the morning, dude. Yeah. Like truly. I was just drinking. I was drinking. And the best part is diet soda is a Fat thing because it's like \n\n0  \n00:35:35\n\nClassic Trump tweet. Yeah. Absolutely. Never seen a thin person order. Order diet coke. Yeah, yeah, yeah, yeah. Yeah. That's good \n\n1  \n00:35:41\n\nBit. He's the man. He's, he's got a couple bangers and then also the other tweet about how bad diet Coke is. He is like, but that's okay. I'll keep drinking their garbage. That's a great tweet too. \n\n0  \n00:35:52\n\nYeah. Like putting it off on like thief, you, this is your fault. \n\n1  \n00:35:55\n\nYeah. But I would fucking crush a you Know we're still trying to get the a and w zero sugar root beer sponsorship. Please. Sorry to, I apologize to bring diet Dr. Pepper into this, but, well \n\n0  \n00:36:07\n\nThis is to show them what they could have this, \n\n1  \n00:36:08\n\nThis could be you but I would fucking Yeah, I was just crushing that. Or like Crystal Light is another Fat guy hack of like, oh yeah, I'm getting hydrated. Diet started. Yeah. Yeah. It's diet water. January, January 1st. \n\n0  \n00:36:19\n\nHere we go. Yeah. January 1st. Water. \n\n1  \n00:36:23\n\nOh dude, fries have to come with everything. Here's the real Fat guy move. It's like when you've transcended even fries and you're like, chicken tenders will be my fries. They are fried. And in your head. In my head I'm like, well, okay. They're both fried, right? Yeah. So that's a wash. Yeah. White meat, chicken, protein, protein. \n\n0  \n00:36:42\n\nIt's good for you. It's good \n\n1  \n00:36:44\n\nFor you. Potatoes. Carbs, starch. Shit \n\n0  \n00:36:46\n\nBad. Yeah. So it's like, stay \n\n1  \n00:36:48\n\nAway from it. So I'm actually doing, and then it's also awesome 'cause then you're like, well I mean the burger does come with \n\n0  \n00:36:54\n\nFries. I can't, so I'm \n\n1  \n00:36:56\n\nNot gonna ask them not to put it there. \n\n0  \n00:36:58\n\nIt's actually fucking with inflation to not have the fries. Like for the economy basically. \n\n1  \n00:37:03\n\nDude, it's so fucked up. I'm, I'm actually on one right now. I'm, I'm in thees of something dangerous on Tyra I think. Oh dude. Yeah, because you go, I go from vacation to you. Know. My best friend got married. Dude, \n\n0  \n00:37:17\n\nYou have to eat a full S cake in your hotel room. Hold on. \n\n1  \n00:37:20\n\nYeah, totally. \n\n0  \n00:37:21\n\nI can't, \n\n1  \n00:37:22\n\nYeah. I can't not come home by myself at 4:00 AM and get McDonald's. By the way, And. I didn't even tell you this. ELs can't Postmates, I \n\n0  \n00:37:31\n\nMcDonald's to my house. \n\n1  \n00:37:32\n\nI'm in the Uber, I'm in the Uber fucking Uber Eats. I'm in Uber. Uber eats McDonald's \n\n0  \n00:37:38\n\nTiming it. So you \n\n1  \n00:37:40\n\nBeat him at the door. Dude. I'm not kidding. The guy parked his fucking bike. I grabbed it. Thank you very much, sir. \n\n0  \n00:37:45\n\nHe's happy. He doesn't have to go upstairs. \n\n1  \n00:37:47\n\nEveryone's a winner. This is perfect. And I had to do it 'cause it was Elvis's wedding. \n\n0  \n00:37:52\n\nYour job creator. \n\n1  \n00:37:53\n\nYeah. I got a little too high. And I was like, I'm getting tired. What, what time did I leave? I left. I left. You left \n\n0  \n00:38:00\n\nLike two 30 I \n\n1  \n00:38:00\n\nThink. Two 30. Yeah. \n\n0  \n00:38:01\n\nMeeting high and going to McDonald's as a teenager. \n\n1  \n00:38:05\n\nThat's nuts. Some great stuff. You, you must've been a, just a, you must've been causing some Fat ruckus over there, right? You Fat ruckus. Didn't you also get sober young too? Or? \n\n0  \n00:38:15\n\nYeah, I don't know. Yeah. Were \n\n1  \n00:38:16\n\nYou doing anything? Were you just getting drunk and fucking around \n\n0  \n00:38:19\n\nOr Getting drunk by myself in the basement eating McDonald's. \n\n1  \n00:38:25\n\nNo fun. you Know. No fun getting too fucked up in Chicago stories or you were, it was just sad. \n\n0  \n00:38:31\n\nIt was all s it was all pathetic. Yeah. I'm gonna get high play GTA five by myself. \n\n1  \n00:38:39\n\nHell. yeah. That's awesome. \n\n0  \n00:38:41\n\nBill. Go eat meatballs. Yeah. Go down to the basement and have some beers. I remember just like taking five Vicodin and watching Star Wars by myself. \n\n1  \n00:38:53\n\nSmiling. That sounds fucking just smiling thick though, dude. Smiling. you know what's so fucked up? Is that sounds awesome. \n\n0  \n00:38:58\n\nPills are so, so good. \n\n1  \n00:39:01\n\nThey're the best. \n\n0  \n00:39:02\n\nThey're the, and like it's, \n\n1  \n00:39:04\n\nYeah. Science has hacked our brains to feel awesome. \n\n0  \n00:39:07\n\nHow And I got a right before the opioid epidemic. \n\n1  \n00:39:10\n\nNice dude. \n\n0  \n00:39:11\n\nSo \n\n1  \n00:39:11\n\nLike Indiana Jones sliding \n\n0  \n00:39:13\n\nBasically slid around, sliding under. But like, I feel like if I stuck around, 'cause it was just so much like in high school, it was just so much easier to like \n\n1  \n00:39:19\n\nYeah, \n\n0  \n00:39:20\n\nYou could Yeah. Get $30 in those mid weeded ever. Yep. Where you could have five incredible pills \n\n1  \n00:39:27\n\nMake \n\n0  \n00:39:27\n\nYou feel perfect. \n\n1  \n00:39:28\n\nBut I do feel like you're right. It was still just a little hard to get them when we were younger. \n\n0  \n00:39:34\n\nJust, \n\n1  \n00:39:35\n\nJust, it was \n\n0  \n00:39:36\n\nLike, and then like oh six, it was like flooded. Yeah. \n\n1  \n00:39:38\n\nOr I remember I went to visit my friend who was like in you Know, my college friend who's in like rural Maryland where they didn't have shit to do. Those motherfuckers. That's where pills got there first. It's like these communities were nothing. The Fuck. yeah. Nothing was going on. Dude. These kids had so many, we got so insanely fucked up. They were like crushing oxys on Blunts And. we were smoking 'em. Oh. So awesome. Then you take one, I just wake up 12 hours later. I'm like, oh. Oh, where the fuck am literally not, don't know where the fuck I am. \n\n0  \n00:40:11\n\nThey're \n\n1  \n00:40:12\n\nSo fucking sick. They're so shout out to my boy. I won't say his name, but \n\n0  \n00:40:14\n\nThat way. And also everybody's my roommate. Everybody. Freshman year, everybody's parents were on them. So it was just like, you steal 'em from your parents. \n\n1  \n00:40:20\n\nYeah. Because \n\n0  \n00:40:21\n\nThey, like the healthcare system was like, yeah, I guess we'll just give you a bottle of Oxycontin. \n\n1  \n00:40:26\n\nYeah. I guess that's the some immigrant shit where I never really, my parents never had pills. Really? They were scared. My, I think my dad was scared to go to the, they were pretty much scared to go to the doctor. \n\n0  \n00:40:35\n\nMy parents will like, just, they have so many like expired antibiotics and they'll just like take 'em. Like I feel a little fucked up today. I'm gonna take like five antibiotics. Yeah. And just like see what happens. They love pills. Pills are so good. Yeah. \n\n1  \n00:40:52\n\nPills are magical. You never, you were never getting into pills. Were you ELs \n\n2  \n00:40:56\n\nNot too much. I remember crushing some Percocet in a weed bowl with you when you came to Brooklyn. Yeah. Early on. That was fucking ss That was fucking \n\n0  \n00:41:03\n\nSmoking pills was \n\n1  \n00:41:05\n\nReally good. Yeah. We were, we. Yeah. ELs ELSs had a little fucking, he lived in the basement in Bedstuy. Dude. And. we fucking, we crushed some pills up. We watched a documentary about Nancy Kerrigan and Tanya Harding had ourselves a nice, what do we have to eat that day? Do you remember? We had a nice, we had something. I don't remember. Were my brothers there \n\n2  \n00:41:24\n\nToo? No, someone else was there. I wonder if, was \n\n1  \n00:41:28\n\nIt Pete \n\n2  \n00:41:29\n\nI? know \n\n1  \n00:41:30\n\nI? Think it might've been one \n\n0  \n00:41:31\n\nOf my brothers. Remembering what you ate is really funny. It's fucking awesome. Dude. My, this my dad. 'cause he eventually became like a city inspector. Wow. So he would like go all around the city inspecting elevators. \n\n1  \n00:41:41\n\nWow. \n\n0  \n00:41:43\n\nAnd he'd like, and anytime my mom, it was very rare whenever my mom, my mom would like go visit my uncle in Florida every once in a while. And then my dad, like, he didn't know how to cook. So he was like, all right for dinner, we, we'll take you guys out. And he knew like all these like greasy spoons and diners and he would just like rotate us through and be like this. And it was kind of like, you know, we were like Fat. Like this is \n\n1  \n00:42:00\n\nAwesome. Yeah, yeah, \n\n0  \n00:42:02\n\nYeah. But I remember we went to this one place, it was at Foster and Damon and my dad, it was like, he guys like this place. It was just like a burger place. And. we went and we're ordering, we ordered our food and we're waiting for it. And then we see me and my brother see this like kind of Fat guy walk in and he's like, yeah, let me get like two hot dogs, double cheeseburger. Can I get pizza puff fries? And he's got this like insanely long order and me and my brother just listening. And then he goes and can I get a piece of cheese while I wait? And they're like, yeah, sure. Like they knew him. They're like, yeah, sure. Here. Oh my God. And I gave him a piece of cheese. And me and my brother are like, that's so cool. That's like such, I'm gonna do that when I move out when I'm single. \n\n0  \n00:42:44\n\nI'm gonna do that \n\n1  \n00:42:45\n\nWhen I'm an adult. When \n\n0  \n00:42:46\n\nI'm an adult. \n\n1  \n00:42:47\n\nI'm gonna ask for waiting cheese. Dude, that's insane. The way you calm down like a nervous dog. He's like, I \n\n0  \n00:42:55\n\nNeed a little Yeah. Trick them into eating pills. Can I A slice of cheese. I \n\n1  \n00:42:58\n\nNeed a little cheese. Man. That's awesome. There is, I really do love Fat people so much. Dude, \n\n0  \n00:43:06\n\nThere is something about it where you just, \n\n1  \n00:43:08\n\nIt's like cute. Are \n\n0  \n00:43:09\n\nForced to be humble. \n\n1  \n00:43:10\n\nIt's, well, it's like cute. That guy is like, he's Fat as shit, but it's like he wants his treats so bad. \n\n0  \n00:43:15\n\nYeah. You gotta have your treat. It's so, it it is kind of people where there is like somebody who's like a sex addict. There's something kind of like dark about it. Yeah. Yeah. Or like pills or drinking. Yeah. There's like, but like food is just like fun. \n\n1  \n00:43:28\n\nTotally. Oh dude. If I was addicted to drugs the way, if I was on one with drugs, the way I've been on one with food. Yeah. I've, I'm dead nine months ago. Yeah. you Know. This is a very, now look, save your comments. YouTube. Oh, nine months ago, maybe two in two months you'll be dead. I'm gonna make it you fucking pricks. But \n\n0  \n00:43:48\n\nI'm gonna make it to the end of the year. \n\n1  \n00:43:49\n\nYeah. Yeah. I mean making it to 35. And then we'll see. That's the goal I've set for myself. But there it's just like it. And in that moment, dude, that guy, like there's shame in it of course, but If, you can If you can get cover from the shame in that moment. It's pure bliss and such a nice 'cause it's it's a happiness. You're right. Yeah. A sex addict. It's like, there's something fucking weird about that. It's like sex is, it is. We, we, we opened it up you shit and piss right outta those holes, you know, you Know and there's something adult and weird about it and dark and it can go really wrong and like, and then you \n\n0  \n00:44:28\n\nCan get a disease and die. \n\n1  \n00:44:29\n\nYeah. Yeah. And even, and yeah. And then people can, you Know obviously do do real bad versions of it, but like, and then drugs, same thing. But it's like food is like, it's the same joy. \n\n0  \n00:44:40\n\nYou have to eat too. \n\n1  \n00:44:41\n\nYou have to eat. But it's like, it's the same joy a baby gets when they eat a fucking lollipop. It's the same joy a fucking \n\n0  \n00:44:47\n\nA baby eating a lollipop \n\n1  \n00:44:48\n\nOr you Know a little piece of candy picturing candy like a three month old. Yeah, yeah, yeah. But yeah, dude, those pic or or a video, a TikTok will go viral where it's like baby eats ice cream for the first time. Oh yeah. And they and his eyes go like, and the baby's like, I'll kill my family for more ice cream. It's like, it is pure. And it's like, I just love and like that guy is hitting his order and he's in a safe place. Yeah. Yeah. There's no one thin in there to make fun of him. No. There's only fatter teenagers being like, respect. We love it. you know? Yeah. Like that. I love that guy. I love that moment for that guy. And yes. Is that moment wrecking his life? Is he Fat as shit as a result? Maybe. But in that moment, man, \n\n0  \n00:45:30\n\nThe only piece of media that ever quite got this right was Sopranos. \n\n1  \n00:45:35\n\nAbsolutely. \n\n0  \n00:45:35\n\nI feel like they Absolutely. And also If, you watch Sopranos, everybody, every character, every scene, every season. Full bites. \n\n1  \n00:45:45\n\nYeah, yeah, yeah, yeah, yeah. \n\n0  \n00:45:47\n\nFull bites, full chewing. Yes. Yes, yes. And like you can see like Gandolfini is kind of, you see him start moving his fork around more Yeah. Before he takes bites. Yeah. Yeah. And it's clear that there was like a directive of like, you have to eat food onto like, you can't, of course, like every other show where people are not eating, like \n\n1  \n00:46:03\n\nAt a restaurant, the pretend they're dipping and they're like, they're about to eat and they're like, yeah, you Know whatever. No, the Sopranos there it is. It you're absolutely \n\n0  \n00:46:10\n\nRight. Picking up the pizza that scene. \n\n1  \n00:46:12\n\nYes. \n\n0  \n00:46:13\n\nIncredible. \n\n1  \n00:46:14\n\nI mean dude. When, when they're, when they're, that \n\n0  \n00:46:16\n\nIs the Fat ethos. If that, if there was a flag for Fat, people'd be Tony going back to pick up the pizza after getting into a fight with Carmella \n\n1  \n00:46:23\n\nAnd all the, like, you're so right. 'cause all of the, like, this man has the wor you Know, he's worried about dying. He's got a, he's executing people, he's worried about the feds. And at the end of the day, dude, he just needs a bowl of ice cream laying on his Fat stomach comes lunch meat. Like he \n\n0  \n00:46:39\n\nHa \n\n1  \n00:46:39\n\nStanding \n\n0  \n00:46:39\n\nUp eating lunch \n\n1  \n00:46:40\n\nMeat, standing up, eating lunch meat. It's like, yes dude. It really is the fattest. \n\n0  \n00:46:44\n\nAnything to fucking, just for one second. Just \n\n1  \n00:46:46\n\nGimme a for one moment. I need to, \n\n0  \n00:46:47\n\nI'm not here. I'm having fun. \n\n1  \n00:46:49\n\nYeah. I mean prosciutto land. It's so fucking, it is the best Fat show. Without question I mean, think about how many Fat characters, there were \n\n0  \n00:46:58\n\nSo many Fat characters. Fat representation. Huge moment for that. But just like I would say that there's no other piece of media, no other movie, no other TV show that shows people how they actually eat. Yeah. And even like in the last episode, spoiler when like at Bobby Vak Lava's funeral when everybody's like going nuts over the food. \n\n1  \n00:47:17\n\nYeah, yeah. \n\n0  \n00:47:18\n\nAnd just like, that's all they're talking about. Yeah. Is like \n\n1  \n00:47:20\n\nTotally \n\n0  \n00:47:21\n\nIncredible. \n\n1  \n00:47:22\n\nAnd even I mean one of the biggest moments in Thera like an emotional beef for Baccala is like when they eat Karen's last ziti incredible. Like his whole, his whole entire wife's being is in that ziti. Yeah. And the, the finally, it is the symbol of being ready to move on when you can eat her zdi. And not only that, but it's like you ingest it like your eating your wife. Basically you and your children are cannibalizing your wife and making room for your, their stepmother and your next wife. Fucking beautiful. You're right. The fa we gotta write an essay dude. We gotta coauthor an essay. Essay about like how Sopranos is the fattest show of all time. \n\n0  \n00:48:02\n\nFattest of all time. Yeah. \n\n1  \n00:48:04\n\nThere's no, there's no other everything else. And, and the other thing is Delini was like a sex symbol back in the day, dude. Like people wanted to fuck him. \n\n0  \n00:48:12\n\nI think that's, yeah. I think it's a little bit \n\n1  \n00:48:14\n\nI mean. He's a big guy too. He is like 6 5, 6 4, whatever. \n\n0  \n00:48:17\n\nBut yeah, he held it good. Also like breathing the show is just Fat \n\n1  \n00:48:22\n\nBreathing. The \n\n0  \n00:48:23\n\nShow is \n\n1  \n00:48:24\n\nThe delini nose, nose whistle, breathing. Ugh. When I got, that's when I'm like, I have to go to the doctor. \n\n0  \n00:48:29\n\nWhen you're just watching tv you're like, who's breath? Oh, it's me. Yeah, \n\n1  \n00:48:32\n\nYeah, yeah, yeah. Jesus Christ. \n\n0  \n00:48:33\n\nDo you have sleep apnea? \n\n1  \n00:48:34\n\nI do. \n\n0  \n00:48:35\n\nDo you get the machine? I \n\n1  \n00:48:36\n\nGot the machine. You machined up. \n\n0  \n00:48:38\n\nNo, you \n\n1  \n00:48:39\n\nDon you don't got it or you do. Got it. \n\n0  \n00:48:40\n\nI, I Fat trade, I classed out right before I got out. \n\n1  \n00:48:46\n\nGood for you man. Yeah. Have you tested to see If? you have it \n\n0  \n00:48:49\n\nSleep apnea? Yeah. I don't have any of the like symptoms of like tiredness or anything like that. Okay. I can't go to sleep ever. \n\n1  \n00:48:55\n\nInteresting. \n\n0  \n00:48:56\n\nI stay up till like three or four every night if I could. \n\n1  \n00:48:58\n\nDamn. Every night. You only need like, what, four hours? You only sleep like \n\n0  \n00:49:02\n\nFour hours? No, no. I'll sleep like, \n\n1  \n00:49:03\n\nOh, okay. Okay. You just have a bad sleep schedule. Yeah, that's fine. ELSs have you, how's the breathing dude? Are you still almost dying? Because I, whenever I'm in a room with ELSs, he'll be like, you Know what I mean? And then I'll be like, dude, you have sleep apnea? He's like, no, I don't ELs can't admit how I mean you're not as Fat as you used to be, but you can't admit that you might have some Fat diseases even though you're looking better these days. \n\n2  \n00:49:26\n\nI'm not as Fat as I used to be like two weeks ago, but yeah, I'm like close to the fattest I've ever been \n\n1  \n00:49:32\n\nRight now. \n\n2  \n00:49:33\n\nBut I don't know in my mind, like I just don't snore. \n\n1  \n00:49:36\n\nOh, you snore In my \n\n2  \n00:49:37\n\nMind, I'm just convinced during my sleep I like kind of breathe a little heavy through my nose, but nothing crazy. \n\n1  \n00:49:43\n\nThat's a, that's a symptom of not being realistic with who you are. ELSs does think he's a little sex, much sexier than he is. I mean he, you, Know ELSs has done fine for himself, but he, in his mind, he's like 40 pounds lighter. He's \n\n0  \n00:49:55\n\nGot the gandini swag. I mean I think that's what Gadel Feeney had too, was he was 40 pounds lighter in his head. \n\n1  \n00:50:00\n\nYeah. Interesting. \n\n2  \n00:50:01\n\nI gotta start dressing like Tony. \n\n1  \n00:50:03\n\nYeah, you do. I need a big \n\n2  \n00:50:04\n\nBar shirt, leather jacket. Yeah, yeah, \n\n1  \n00:50:06\n\nYeah. \n\n2  \n00:50:07\n\nThose fucking golf shirts or whatever. \n\n1  \n00:50:09\n\nYou could do that. You \n\n0  \n00:50:10\n\nCould easily do that. \n\n1  \n00:50:11\n\nWe're thinking of. Yeah, we're thinking. 'cause Elvis is my you Know? He's on the road. He is my road manager too. So we gotta get 'em like road manager outfits. I think it cowboy. Cowboy hat. Colonel. \n\n0  \n00:50:19\n\nYeah. I think you need to say, well like what's the Albanian version of that? \n\n1  \n00:50:23\n\nThey don't got shit. \n\n0  \n00:50:24\n\nYou Know. It'd be good, like some kind of like mil weird esoteric military dress uniform. Yeah. Like If. you ever like searched a, what is it like If you like, he guess like a Rhode Island state trooper or something like that. Oh, \n\n1  \n00:50:42\n\nOkay. Or like \n\n0  \n00:50:42\n\nBoston State \n\n1  \n00:50:43\n\nTrooper. Now should he dress it down or should he have like, isn't that, isn't that me, myself and Irene Rhode Island State Trooper. Yeah. I just watched that recently. It's \n\n0  \n00:50:52\n\nA fucking like that. Like \n\n1  \n00:50:54\n\nInteresting. Or \n\n0  \n00:50:55\n\nSearch Spanish. What is it? Foreign Legion. Ooh. \n\n1  \n00:51:03\n\nYeah. Spanish Foreign. I didn't even know they had one. I know they got the French Foreign \n\n0  \n00:51:06\n\nForeign Legion uniform. Yeah. Ooh. It's like really kind \n\n1  \n00:51:11\n\nOf, those guys are fucking pieces of a I mean that looks like gay porn, to be honest with you. \n\n0  \n00:51:16\n\nWell they have like their own like ceremonial goat too. Wow. \n\n1  \n00:51:20\n\nWow. Yeah. That's a good look. Elvis. Yeah. Look up the Albanian. Look up Albanian military uniform. I would love to see what it's, it's probably just like a, it's just like shit they bought at a surplus store. It's probably just, it's the most basic camo you've ever seen in your life. \n\n0  \n00:51:35\n\nYeah. Or like Halloween costume. \n\n1  \n00:51:37\n\nLiterally it doesn't, it's Yeah. \n\n0  \n00:51:39\n\nResearch dress uniform. \n\n1  \n00:51:41\n\nYeah. What this is, what are the, the combat? Yeah. Let's see what the officers are looking like. \n\n0  \n00:51:48\n\nAll. Whoa. That guy with the cape \n\n1  \n00:51:50\n\nUniforms of Albania honorary guards. \n\n0  \n00:51:54\n\nI mean This guy with the, the, the guy with the cape that \n\n2  \n00:51:57\n\nLooks pretty sick. \n\n1  \n00:52:00\n\nThat's the, that's the Republican guard. None of them are the same. They change it every time. Anyway. Whatever. Fuck you. Elvis. \n\n0  \n00:52:09\n\nSome kernel type shit. Yeah. \n\n1  \n00:52:11\n\nWe do need a little, we do need, we do. You do need something brother. I \n\n2  \n00:52:14\n\nKept joking with Stavin. Like we were just on the West coast for two and a half weeks leading up to this special and he was just so run ragged. I was like, you could do what you want. You can get your fuck on, eat whatever you want as long as we get you up on stage in Austin. \n\n1  \n00:52:32\n\nI did. I was really fucking losing my mind there for a while. I was getting, I was acting out a little bit, but \n\n2  \n00:52:38\n\nI'm like, I'll, I'll, I'll talk to the venue. He'll be there. Don't worry. He'll be there. \n\n1  \n00:52:41\n\nStart the show. Put JP on. He will be there. We any later when we go into overtime, forget about it. He'll be there. \n\n0  \n00:52:51\n\nWhatever. I was thinking about you And. I feel like, 'cause you're, you're a sex guy. You like sex. \n\n1  \n00:52:57\n\nI am a sex guy. \n\n0  \n00:52:58\n\nYeah. But I think what protects you Yeah. Is that you're a tit guy. Mm. And. I. Feel that interesting Exhibit A what I'm gonna do. And not that I'm saying that there's any accusations. You're clean as far as I know of this recording of this podcast. Thanks. 'cause Vulture would not have put you. \n\n1  \n00:53:16\n\nThat's, you're right. You're right. I'm one of the comedians legitimate. You can and should know, \n\n0  \n00:53:23\n\nBut like Seinfeld when he was dating that high school kid. Yeah. I think the reason it never stuck is 'cause she had huge tits and like that interesting theory. That's like an adult thing. \n\n1  \n00:53:35\n\nRight. Visually looks. You're right. There's no, it's not Lolita esque. Yeah. \n\n0  \n00:53:41\n\nWhere like Woody Allen. It's like That's right. Yeah. We'll see what you're trying to do buddy. \n\n1  \n00:53:46\n\nRight, right, right, \n\n0  \n00:53:47\n\nRight. You're not getting this past us. \n\n1  \n00:53:48\n\nYeah. \n\n0  \n00:53:49\n\nSein. That's a good point. \n\n1  \n00:53:50\n\nOkay. Big tits. Everyone's like, \n\n0  \n00:53:53\n\nAnd there's something about big tits guys that like big tits. It's like so sweet. \n\n1  \n00:53:58\n\nThank you a maternal. I love my mom so much. I wanna suck on big titties. Yeah. Which that's kind of the, because you're not like, \n\n0  \n00:54:06\n\nI wanna ah, it's like I wanna suck on \n\n1  \n00:54:08\n\nThem. Yeah. It's silly. It's like Ba. It's \n\n0  \n00:54:12\n\nFun. It's, there's a silliness to it. It's \n\n1  \n00:54:13\n\nFun. There's \n\n0  \n00:54:14\n\nA playfulness. \n\n1  \n00:54:14\n\nThere's a playfulness. I think that's my overall vibe. Vibe. It's like, yeah, come on. I'm not kinda, yeah, we're out there. I'm getting sucked off. But it's a good time. \n\n2  \n00:54:24\n\nIt feels big. Titties feel like a Fat guy thing Too. Big titties are like a big juicy awesome. Like guy flirter like Yeah. I feel like Fat guys are probably like more into big ass titties than a big ass. \n\n1  \n00:54:35\n\nThat's interesting. Yeah. And listen, don't get me wrong ladies. I do love a big ass of course as well of, but \n\n0  \n00:54:40\n\nI mean it's generally 50 50 for \n\n1  \n00:54:42\n\nEverybody. I am tits first and for, but if If, you really put a gun to my head, And. I could only have one. I am picking tits. But you Know. That doesn't mean I'm not gonna, that doesn't mean every once in a while I don't want to flip flop. I love a nice big ass And I go some little tit i'll. And that's a common misconception about tit guys. I like titties of all shapes and sizes. Yes. I will take a little titty. you Know. But you Know. But yes, \n\n0  \n00:55:09\n\nI will take, I won't send it back. \n\n1  \n00:55:10\n\nI'm not sending it back to the chef. I'm absolutely not. I will bring, I will eat it with, I'll put 'em my mouth with a smile on my face \n\n0  \n00:55:18\n\nOf a chicken finger french fries \n\n1  \n00:55:20\n\nSituation. Yeah, yeah, yeah. That is true. Big ass, big titties is like, that's the chicken fingers fries. It's like I'm getting, I'm getting gluttonous. I want 'em both. I need a nice thick meal. \n\n0  \n00:55:32\n\nThis room has a little bit I mean. Doesn't this have a little bit of a vibe to you of like you're over at your friend's. Like this is a place you'd go in high school. \n\n1  \n00:55:41\n\nA hundred percent. That's Thank you for saying that. And my mom is cool \n\n0  \n00:55:43\n\nWith, with us smoking. \n\n1  \n00:55:44\n\nThank you for saying that. That's the vibe we want in the podcast. Yes. Is you're just hanging out. No one gives a fuck. My \n\n0  \n00:55:49\n\nMom's in the other room. She doesn't care if we smoke cigarettes. And we house. \n\n1  \n00:55:52\n\nShe doesn't care. She'll bring Totino's pizza rolls in. Yeah. Any minute now \n\n0  \n00:55:56\n\nYou I have AVHS copy of kids we can watch. \n\n1  \n00:55:59\n\nYep, yep, yep. Like that house. There's a fucking couple playboys. \n\n0  \n00:56:02\n\nThere's a fucking \n\n1  \n00:56:03\n\nBong. There's a bong ready to go. Shout out to our good friends at Freeze Pipe. That's just free advertising folks. You can thank Connor for that. \n\n0  \n00:56:12\n\nSmoke weeded every day. Give behind the wheel of a car. Drive into the White House. \n\n1  \n00:56:16\n\nThat's right. That's, and if we wanted to kind of do one thing, it's like And, we insist you do some kind of terrorism towards the White \n\n0  \n00:56:23\n\nHouse. You have to, you have to. Do you remember, do you remember that guy that set himself on fire in front of the White House in like 2017? I \n\n1  \n00:56:32\n\nDo remember \n\n0  \n00:56:32\n\nThat guy. He had the USA shirt. \n\n1  \n00:56:33\n\nYeah. And no one gave a fuck whatsoever. \n\n0  \n00:56:35\n\nNobody cared. And I remember I remember like hearing about it and going to Twitter to see it. And I had to watch an ad for like Quibi before I saw the video. And remember being like, this is the most dystopic thing ever. \n\n1  \n00:56:48\n\nYeah. I know I do remember hearing about that and being like, whoa, this is kind of something might, and then no one gave \n\n0  \n00:56:54\n\nFuck they meet. Nobody gives you at all whatsoever. There's so many people that set themselves on fire. \n\n1  \n00:56:57\n\nDude. So many people do. So dude. And it and it's like \n\n0  \n00:57:00\n\nFor attention, \n\n1  \n00:57:01\n\nThe shit. How crazy shit has to get to make the news is wild. Like my, there was a, there was a guy who just a student in a Baltimore public high school. I have a friend who works at a, at a high school, had a gun and just fired off into the quad but didn't fire at anyone and it barely made the local news. This is high school. This is a high school. This is like, this just happened. This isn't like when I was in high school. Yeah. Yeah. A friend of mine is a teacher. Some kid just in the quad, pop, pop, pop, pop, pop. Didn't even make the local news, let alone the fucking, like there's some kid had a gun. \n\n1  \n00:57:40\n\nNo one gives a fuck. \n\n0  \n00:57:41\n\nThis is a bad like bad neighborhood, bad school. \n\n1  \n00:57:43\n\nIt's not a real, not I mean it's not great, but it's not like the worst. It was like, I \n\n0  \n00:57:48\n\nFeel like it's gotta be like a private school for like it to get attention. It's gotta be Columbine. Like a school at Columbine's Life. \n\n1  \n00:57:54\n\nMaybe. But it's cra it's crazy. A guy, a kid fucking shot a gun and no one real, it wasn't even like that big a deal. It's so funny. Like no one got a day off. Like it wasn't like there, there was no school psych colleges that came in. It was just like, all right. That was kind of fucking weird. \n\n0  \n00:58:09\n\nWhatever. Yeah, no it's fine. Right. \n\n1  \n00:58:11\n\nBut anyway, listen Connor, we need you. We need some of your expertise man. We need, we need you to help these people I \n\n0  \n00:58:17\n\nKnow a lot about entourage \n\n1  \n00:58:20\n\nAnd. we should also say by the way, go check out. You have a hilarious, like a short film. What do you, what would you call \n\n0  \n00:58:28\n\nIt? Yeah, we're doing paywall content in the most confusing way possible. \n\n1  \n00:58:32\n\nIt is really hard to get, \n\n0  \n00:58:34\n\nYou gotta go to a website called endorphin port.com for $5. You buy a short films 24 minutes long called The Mask that I made. \n\n1  \n00:58:42\n\nIt's really funny. But I \n\n0  \n00:58:43\n\nTried for me being fake weird on the street. \n\n1  \n00:58:47\n\nIt's very, but it's fun. I tried to rewatch it and it was like you got e send us your email address again And, we will re-mail you a link and it just wouldn't work. So you know, you got a couple technical things. So listen, there's some challenges. Watch it when you buy it. Watch it the moment you buy it. Yeah. But it is funny as shit. And, we didn't even say you Know con Con. You probably know Connor from a bunch of fucking shit. We didn't even talk about the very beginning of like your mysterious vines where I was like, who is this guy? Oh yeah. That was fucking awesome. It goes all the way back to, to Vine to I mean. Obviously you've probably seen it. \n\n0  \n00:59:23\n\nObama administration, \n\n1  \n00:59:24\n\nHe was in the Obama administration. Him and Cal Pen were co speech writers. They were. And yeah. And you Know I think you should leave. Obviously people know you from that shit. A ton of fucking awesome shit. And all your online sh online videos. I did. I do. We'll go into the stuff first. But I do wanna say, even though you're probably tired of talking about it, 'cause it was so long ago, there was really something also about those like, like how crazy and, and like you had no idea who you were on those vines and the wild shit you would do where it's like you Know My favorite one, one of the best ones is like you just have a, you're in a lawnmower. \n\n0  \n01:00:01\n\nOh \n\n1  \n01:00:02\n\nYou have a gun? Yeah. And then it pulls up and you point it at a cop that looks fucking And I. Just remember being like, what the fuck is going on here? They were so I mean such good shit. Have \n\n0  \n01:00:16\n\nTo stay tuned. You have to watch The Mask to find \n\n1  \n01:00:18\n\nOut. You have to watch The Mask to find out. But anyway, \n\n0  \n01:00:20\n\nAlso If. you want just DMM me? I'll send you the master free. Yeah. \n\n1  \n01:00:24\n\nI already bought it once. But send it \n\n0  \n01:00:25\n\nTo me. I'm saying, I'm saying it to oh \n\n1  \n01:00:26\n\nTo them. \n\n0  \n01:00:27\n\nI don't fucking care. Whatever. I'm, I'm a bad business man. \n\n1  \n01:00:31\n\nYeah, that is fucking, that's so fucking funny. DMM Connor. He'll send you the shit for free. Fuck him. He doesn't need the money. He's good. He's still, he's got that, he's got, he comes from a long line of elevator mechanics, dude. Yeah. We got a lot. This dude, this guy's got elevator. This guy's got T thp Kreen money. Hey \n\n0  \n01:00:47\n\nTyson, ti Tson, Crump, \n\n1  \n01:00:49\n\nTson, Crump. Sorry I took a shot. So anyway, go. Yeah, go watch that shit. And now let's, let's fucking, let's answer some of these motherfuckers questions. Elvis hit us with one babe. \n\n5  \n01:01:05\n\nHey SAVI. What's up? It's your boy Bri. What's up Elvis? \n\n1  \n01:01:08\n\nHello Bri. Hey. \n\n5  \n01:01:09\n\nSo I have this conundrum man. I work at a gas station, right? And it's owned by a family, right? And everything's nice. Everything's chill for the most part. But like the owner, the lady who owns the store, she keeps like you Know touching me on my arm and feels my arm up in the shit. And like I have a partner and stuff. And I. Don't wanna make it weird because it's a whole family affair kind of thing. So my question is, how do I bring it up to my supervisor, which is the lady's son that, that I'm kind of uncomfortable with this. \n\n5  \n01:01:50\n\nOr should I just tell the owner upright? I, I just don't want to make it weird. That's all. Thanks. See you at the Hippodrome in October baby. Bye bye. \n\n1  \n01:01:59\n\nThanks man. I'm actually at the lyric, but I hope you bought tickets to see me at the Lyric and not probably like the Lion King at the Hippodrome or something like that. This is awesome. So this guy's getting sexually harassed at this gas station job. \n\n0  \n01:02:14\n\nI mean we need more details. What is the ethnicity? Oh \n\n1  \n01:02:17\n\nYeah. Of \n\n0  \n01:02:18\n\nThese people. \n\n1  \n01:02:19\n\nYeah. Gotta be you Know. You'd think Indian or Korean or something like that. Foreign for sure. I feel like. \n\n0  \n01:02:27\n\nYeah. \n\n1  \n01:02:28\n\nOr I guess you Know. And I. Guess this could theoretically be a a redneck family. \n\n0  \n01:02:32\n\nThat's true. It was Bri. He's, \n\n1  \n01:02:34\n\nHis name is Brian. Where's \n\n0  \n01:02:35\n\nThe hippo drum? \n\n1  \n01:02:36\n\nHippo drums in Baltimore. \n\n0  \n01:02:38\n\nOkay, so it's east coast, right? East \n\n1  \n01:02:40\n\nCoast. So he's like, I ha he works at a gas station. Loves it. No problem with working. I'm trying to think what doesn't have an issue with the gas station. No. She keeps like touching my arm and feeling my arm and shit like that. \n\n0  \n01:02:51\n\nI'm trying to think what is the most on the spectrum way to deal with this. Like \n\n1  \n01:02:55\n\nIf, you were the most alpha way to deal with this. \n\n0  \n01:02:57\n\nNot, not alpha, but just like \n\n1  \n01:02:58\n\nDon't tell Spectrum is alpha. That \n\n0  \n01:03:00\n\nIs. Yeah. Like, oh yeah, please \n\n1  \n01:03:02\n\nDon't touch me. It makes me feel uncomfortable. That's the \n\n0  \n01:03:04\n\nAlpha. I think that's way to do it. Yeah. Just walk straight up to her in a straight line. Put your hand on her forehead and say that. \n\n1  \n01:03:12\n\nYeah. I mean that. Yeah. You might have to freak out. You might have to start screeching and covering your ears. But you work for a fucking mom and pop gas station buddy. This is where you get, this is the kind of job you get sexually harassed at this \n\n0  \n01:03:27\n\nAlso doesn't feel like, hey let's go to the bathroom and fuck vibes. Yeah. It just feels like what? She's \n\n1  \n01:03:34\n\nA little too familiar. I mean she's making 'em uncomfortable in any other place. You could, you could complain somewhere. But they own the company and it's like, let's say you complain. What do you, what's the complaint? Hey, I think your mom kind of wants to fuck me. And you think the guy's gonna be like, oh sure, let me go talk to her about it. \n\n0  \n01:03:53\n\nAnd also like you're for sure like taking Skittles and shit. Yeah. Like there's no way you're \n\n1  \n01:03:57\n\nLike Right. And if you're not, you should start stealing. Yeah. Because that's the thing about a place like this, there's pros and cons. Con, you're getting mildly sexually harassed pro. You get a Reese's fast break whenever the fuck you want. \n\n0  \n01:04:10\n\nAnd you could probably like no call, no show like four weeks in a row. Yeah. And you'd be like, whatever. Yeah, \n\n1  \n01:04:15\n\nSure. Yeah, yeah. Brian, I hate to break it to you man. This is not, you know, there's no HR here. you know the \n\n0  \n01:04:21\n\nSolution is start fucking grinding, dude. Mm. Get up, get up early. Yep. Start you Know. Yep. Meditating, doing yoga. Working out cold plunge. Same time Cold plunge. Do a cold plunge. Do a \n\n1  \n01:04:31\n\nCold plunge. Get ready. Ready for your gas station job. \n\n0  \n01:04:34\n\nTake a Turkey Ba full cold water. Shove it up your ass. Write up your whole internal cold plunge. \n\n1  \n01:04:40\n\nOh they're not doing that. \n\n0  \n01:04:41\n\nThat's, and then get, start doing drop shipping on the computer. \n\n1  \n01:04:45\n\nSeven. \n\n0  \n01:04:46\n\nAnd then you'll be owning gas stations where you'll be able to touch people. \n\n1  \n01:04:50\n\nDo drop shipping. Yep. Do drop shipping. Get a, get a rental property and start renting that out. Buy a gas station. Pull your penis out to your employees. \n\n0  \n01:05:01\n\nYeah. I can't think of like, oh this is a woke gas station owner. There's, that doesn't exist. It's a different \n\n1  \n01:05:08\n\nWorld. I know. That's what I'm saying is like, what are you Bri? I'm sorry dude. But it's like you, the industry are doing work at a gas station. Like it's not get a different job. There's no way. There's no way. The pay is good. It smells like gas all fucking day. Like come on dude. The answer is either just accept it and start stealing or get a better job. Yeah. That's it. That's fucking hilarious. I've never, have you ever been sexually harassed? \n\n0  \n01:05:35\n\nNo, I don't think so. I think I'm too dumb. I think I have you And I And. I've, it's taken me like four years later to be like, oh wait a minute. \n\n1  \n01:05:42\n\nOh, what the hell was \n\n0  \n01:05:42\n\nThat? I don't think they were coming onto me. But \n\n1  \n01:05:44\n\nELSs, \n\n0  \n01:05:45\n\nI don't think so. \n\n1  \n01:05:46\n\nFor me it's only been like gay guys who are like, all right man, chill out. \n\n0  \n01:05:50\n\nI will have like, 'cause I have big calves, I will have like the weirdest men come up to me and talk to me about my legs. And I've never had a woman once be like, I wanna suck your leg. Like, \n\n1  \n01:06:02\n\nDude, that's a great point. 'cause you Know. I'm on, I'm on team Big Cal as well. Yeah. Yeah. And it is always like, that's not sexual, but it's like bodybuilder guys who are jealous that you have big calves. \n\n0  \n01:06:13\n\nThey're also like always Fat too. There's, it's like a, it's unhealthy man. Oh yeah. \n\n1  \n01:06:17\n\nHow do you do that? Yeah, yeah, yeah, yeah, yeah. 'cause the calf is, and the secret is you just are Fat as shit your whole life. \n\n0  \n01:06:22\n\nYeah. You just basic \n\n1  \n01:06:24\n\nBasically carry around around \n\n0  \n01:06:25\n\nFat guy. Kinda a weighted vest for the first 20 years. But \n\n1  \n01:06:27\n\nThat's also not true. 'cause I know Fat guys that don't have great calfs. We got something else going for \n\n0  \n01:06:31\n\nUs. And I was my, we, me and my family went to like 20 members of my family went to a Cubs game. And a lot of them aren't Fat and they got like little ape calves, like a caveman calves it run it, it just runs. We're supposed to be Wow. Moving potatoes in the diet up \n\n1  \n01:06:45\n\nThe cliffs. You're supposed to be using those calves. \n\n0  \n01:06:47\n\nWe're supposed to be frontline soldiers. Nonstop. We're not supposed to be here. \n\n1  \n01:06:52\n\nYeah. Alright, El, what else we got? \n\n6  \n01:06:59\n\nHey Stub. So I've just been having trouble. I am 24 And I recently. you Know lost all my hair on bald the a receding hairline. Mm. And only thing is I just have a problem with my confidence. Yeah. you know, I don't mind not wearing like a hat at work. 'cause you know, I, I can't wear a hat at work, at work in hospital. So like I don't have that problem. you know, I post pictures of me bald, but it's just like when I, whenever I get around my friends, I just have to have a hat on. I don't know why. Mm. \n\n1  \n01:07:34\n\nI'm like \n\n6  \n01:07:35\n\nScared of being, I don't know, ostracized. Just, you know, just being like the only 20 something year old that's bald, but no, no hair. It's just like killing me. I know the way you've been rocking your, your due. You just didn't give a fuck. I just need some po pointers on how not to give a fuck and just, just be beautiful in my own sense. But Thank, you so Thank. you Elvis have a great day and Thank you to the guest. \n\n1  \n01:08:03\n\nYeah. Man. Well I got news for you. Nobody's fallen for the hat. The hat thing. No one's like, is this guy not bald? No one. Like I, I, the thing is you look, this is gonna be harsh, but it's, you need to hear this. You look stupid. Beanie inside summertime. \n\n0  \n01:08:24\n\nDid he say beanie? He \n\n1  \n01:08:26\n\nSaid hat. But you Know. I'm sure it's a couple, \n\n0  \n01:08:28\n\nBut I feel like everybody's wearing baseball hats now. Yeah. \n\n1  \n01:08:30\n\nEspecially in Brooklyn. If look, if the hat is part of your outfit, that's one thing you can accessorize, but you just don't want it to feel like you're hiding anything. And he already said like, you Know, he doesn't wear a hat at work. Whatever. I just feel \n\n0  \n01:08:45\n\nCan't wear a hat at the hospital. What is that? I worked at a hospital. Did \n\n1  \n01:08:49\n\nYou wear a hat? \n\n0  \n01:08:50\n\nI don't, I actually, I don't remember wearing, I don't think I wear a hat. \n\n1  \n01:08:52\n\nYeah, I don't think, I don't think he wear a hat at the hospital. No. Feels weird. \n\n0  \n01:08:55\n\nThat would be weird. A doctor comes in with, it comes in with like a Bruins hat on. \n\n1  \n01:08:59\n\nYeah. Or like even one of those little stupid caps. \n\n0  \n01:09:02\n\nYeah. But remember the bike guys would wear \n\n1  \n01:09:04\n\nYeah, yeah, yeah. You don't want a doctor in headwear. They wear \n\n2  \n01:09:06\n\nThose little hot hospital hats. Or is that like surgeons \n\n1  \n01:09:09\n\nOr something's \n\n0  \n01:09:10\n\nKey That feels very Soviet. \n\n1  \n01:09:11\n\nYeah. I think it's, I think it's like a little, I think it's a little like keep the hair out \n\n0  \n01:09:17\n\nThing. \n\n1  \n01:09:17\n\nYeah. Yeah. But you can't be wearing no hat. \n\n0  \n01:09:19\n\nSo Yeah. A hospital would be a perfect place for hair or for hat? \n\n1  \n01:09:22\n\nWell, I don't think it is. I think maybe bandana at best. \n\n0  \n01:09:25\n\nOkay. Well do a bandana. That'd be, \n\n1  \n01:09:28\n\nHere's my feeling is you're so like whenever I see a guy and he's like dressed nicely, but he's wearing a hat. It's like we know you're fucking bald. You're not, you're only in a weird way, you are only drawing attention now. Like you said, a lot of people in, bro, you Know in a casual outfit. Definitely a, a hat is possible. you Know, you go out on a night, you're wearing some fucking jeans, whatever. Like, as long as it makes sense with the outfit, that's one thing. But there's nothing like, it's just screams insecurity to me when you see someone in like a button down shirt or, and they are wearing like not a baseball cap, but like they're trying to be like cool with it. And they're like, you Know like a skull cap or like one of those little caps or like a or a fucking beanie. \n\n1  \n01:10:14\n\nIt's like, bro, you should not be wearing a beanie with a suit. No, we know. No one is fucking no one. You're not tricking anyone. And I would say you're only drawing more attention to it. I would my, here's what I would just do, bro. This is your life now. I started going kind of bald in college. And I was, I had a bald spot forming. Okay. And. I was like buzz cut before it gets crazy. Yeah. You were \n\n0  \n01:10:38\n\nBald \n\n1  \n01:10:39\n\nFor So that I'm the buzz cut guy. Yeah. Right. Yeah. And so, and that's fine. You can be the buzz cut short. \n\n0  \n01:10:45\n\nAnd I knew you And I never was like, oh, bald stop. Right, right, right. Like you \n\n1  \n01:10:51\n\nDidn't lead with it. I don't, I don't lead with bald. You just cut your hair. Keep your hair as short as you need it to be. \n\n0  \n01:10:56\n\nLiterally nobody gives a dude, listen to me. Shut the fuck up. Yeah. Nobody gives \n\n1  \n01:11:01\n\nA fuck. No one gives a single fuck. \n\n0  \n01:11:02\n\nBut it's hard 'cause it's like, oh well \n\n1  \n01:11:04\n\nAnd he's 24. That's tough. But that's about when I shaved, I went shaved. \n\n0  \n01:11:08\n\nThe thing is you need to again, grind set. You need to start waking up 3:00 AM minimum. Yep. You have to start doing exercises that give you severe injuries and your shoulders and knees. You have to work through it. You have to really, really disfigure yourself. So that \n\n1  \n01:11:25\n\nIs what people notice \n\n0  \n01:11:26\n\nBefore hair. And they're like, well at least you got some hair. Yeah. But like, yeah. I don't know. Did you ever feel a pressure to do like go to Turkey, get the surgery? \n\n1  \n01:11:36\n\nNah dude. It was like, for me it was like, alright, fuck it. I'm like, for me it was like, it's being realistic with yourself. Same thing with like Fat guys too, where it's like a Fat guy that's always trying to squeeze into a shirt that's one size too small. Yeah. It's like no one sees no one's like, oh he, he technically fits into an Excel so he's not Fat. Like no one's gonna see your hat and be like, well he's wearing a hat. He must not be, I don't know for sure. He is not bald. So once it happened once I was like, now it was hard to come to grips with it. It was, yeah. Like didn't, especially when you're in your twenties, when you're And I was in, I was in college when I was like, but I had to just, I had to be realistic with myself and not being realistic. \n\n1  \n01:12:18\n\nYou're not gaining anything. you Know what I mean. Like Yeah. You just have to see. You have to, it's gonna hurt. You're gonna have to see yourself the way other people see you. And you don't wanna do that. 'cause you live in a little fake world where you still have a little hair by certain angles. you know what I mean, but you don't. You're bald. Okay. Shave the shit. And here's the thing. Start trying to get confidence other ways. you Know what I mean? I \n\n0  \n01:12:41\n\nGet a gun. Get \n\n1  \n01:12:42\n\nA fucking gun. Anybody looks at, \n\n0  \n01:12:43\n\nLooks like a lot of guns. \n\n1  \n01:12:44\n\nAnybody looks at you sideways. The fuck was \n\n0  \n01:12:47\n\nThat? Yeah. Start, go move to a state that's open carry, open carry 24 7. That's \n\n1  \n01:12:52\n\nAwesome. Oh, that's \n\n0  \n01:12:52\n\nTrue. And you Know look into you Know a lot of fema. What are they doing with these? you Know. What is FEMA doing? Yeah. Look into that stuff. \n\n1  \n01:13:00\n\nTrue. Start going gun shows. \n\n0  \n01:13:01\n\nYeah. \n\n1  \n01:13:02\n\nGive yourself a, a different identity. \n\n0  \n01:13:04\n\nWaco read about, yeah. you Know Ruby Ridge. Discover these things. you Know the order, you Know figure out who they were, what were they, what what they want. \n\n1  \n01:13:13\n\nGet really into \n\n0  \n01:13:13\n\nThe fuck. Just get into guns, \n\n1  \n01:13:14\n\nGroups and guns. \n\n0  \n01:13:15\n\nAnd then there will be some woman who is like, wow, you have so many cool guns. Yep. You marry her and then hopefully you haven't done a terrorist attack by then. \n\n1  \n01:13:22\n\nYeah, yeah, yeah, yeah. Hopefully she catches you right before you're about to do terrorism when yourt is at its highest. Yeah. Yeah. And then you bust one nut and you're like, oh, what was I up, I was gonna do terrorism. What the \n\n0  \n01:13:35\n\nFuck? Everyone that was pushed into doing a terrorist attack by the FBI, they should have just nutted \n\n1  \n01:13:40\n\nOne nut and it's not happening. \n\n0  \n01:13:42\n\nWell I'm not doing that. \n\n1  \n01:13:43\n\nEven the guys that did nine 11 where they were at the strip club and shit, it's like if one stripper sucks those guys off, we still can fucking bring whatever we want in there. On airplanes. You could still bring your pocket knife if one of those strippers sucked. you Know alazar or whatever the fuck the guy's name was off. I still, I do think there is a funny, the way there's like a, the way they you Know Tarantino did in glorious bastards and it's like a re historic retelling of things going different. Yeah. I want to do the, those nine 11 hijackers taking flight lessons and then getting pussy finally and being like, we're not doing it. Because they seemed on the fence like it seemed like. \n\n1  \n01:14:25\n\nYeah. Or not on the fence, but it seemed like definitely a couple of them were probably like, oh come \n\n0  \n01:14:30\n\nOn we really doing this. We're \n\n1  \n01:14:31\n\nReally I mean. This is all fun and shit. But come on, when are we, we were seeing titties back there. \n\n0  \n01:14:36\n\nThere \n\n1  \n01:14:36\n\nWas a barber and then somebody was like, dude, we're gonna get, think of all those whores 10 times hotter virgins for fucking blowing up. you Know crash into the World Trade Center. So it's like, you know, there would be a really fun, there's a really funny, \n\n0  \n01:14:51\n\nMaybe that's what happened with the Shanksville plane. Those guys got pussy on the plane and then \n\n1  \n01:14:56\n\nOh, interest capital. Yep. Let's just get sucked off. Is that United 93? Is that that that plane. That would be a really fun little imagine if story those guys like, ah, we actually we're good. We don't wanna do this fucking bullshit and we're gonna snitch on Saddam. Or not Saddam. Sorry. \n\n0  \n01:15:18\n\nI mean, I also say you didn't, you had swag. \n\n1  \n01:15:22\n\nThat's the thing. It's like you got so Yeah, you gotta, you gotta, if you're gonna go go bald head, do other shit that like gives you confidence. Right. So for me that's when I start, that's when I was like, I got glasses. I was like, let's, let's accessorize a little bit. Let's get a, let's have a style. you Know what I mean? Like let's, even when I was broke I kind of was like trying to dress a little nice. you know, like when I'm, when I'm out there, I would like, when I'm trying to like you Know, there were definitely times in life where I'm Fat as shit. I'm working an office shop. I'm so depressed. I have the worst clothes of all time. I'm just wearing khakis with an elastic waistband. And like just the most Van Huen came out of a box shirts. You've ever seen plaid \n\n0  \n01:16:01\n\nShirts walking in the Van Huen show? Yeah. Yeah. \n\n1  \n01:16:05\n\nMe and your elevator mechanic father probably dressed a lot alike. Yes. Yeah. But when I was like, when my self-esteem was back up, it was like, yeah dude, you gotta, you gotta do something that makes you feel good that that could just be working out. That could be you Know maybe grow a little beat. A lot of guys go beard when they're bald. you Know like If you can't do like I don't have a great beard. I go fucking mustache. you Know what I mean? Figure out what you can do to make yourself feel a little better. And that's it. But you gotta stop wearing hats where it doesn't make sense. You look stupid. I promise you that. It's hot as you're sweating and you gotta beanie on people were like fucking weirdo. What were you doing at the hospital when you worked at the \n\n0  \n01:16:43\n\nHospital? Patient transporter. \n\n1  \n01:16:45\n\nOh, Hell. yeah, \n\n0  \n01:16:46\n\nDude. For an outsourced company. So \n\n1  \n01:16:48\n\nYou were just moving like old people and shit around or? \n\n0  \n01:16:51\n\nYeah. Well I, the first day I had to move a dead body. Oh \n\n1  \n01:16:54\n\nFuck. \n\n0  \n01:16:54\n\nWhole time I thought it was a prank. \n\n1  \n01:16:57\n\nThat's when you're smiling. You're like, \n\n0  \n01:17:00\n\nI was, I was like psyching myself up. 'cause I'm like, they're gonna jump out any minute. And then I was like, Nope. \n\n1  \n01:17:04\n\nNo. Just a dead body. \n\n0  \n01:17:05\n\nThis is what your job is. Yeah. This is what you're getting paid. Minimum wage \n\n1  \n01:17:08\n\nFor it. Minimum wage to move dead bodies to move dead bodies. Oh my God. Yeah. At least Mafiaa guys got a ni a nice pretty penny to move a dead bodies. Yeah. Yeah. You get a pinky ring head from a sex traffic Ukrainian stripper. you Know. Cool stuff. All right, let's, let's get Good luck to our bald friend. Good luck brother. \n\n7  \n01:17:34\n\nHey SAVI. Hey ELSs. Hey Gu. Love the pod. I have a weird problem at work. So I am a scientist at a small lab. And. I. Think one of my colleagues took my lab notebook home for the weekend. Hmm. Snooped through it and tried to put it back without me noticing, which of course I did. So about a month or two ago, I was put onto this project with this colleague who had been struggling with, with it for the past like six months. Oh \n\n1  \n01:18:05\n\nWow. Someone stole your shit. \n\n7  \n01:18:06\n\nAnd in the past two months I've made a ton of progress to the point where I'm pretty much set to finish it up in the next like week or two. But there's always been like some tension with this dude because while he's technically more experienced, he's like 10 years older than me. He used to be a professor. He's just like pretty bad in the lab. So like I share all my results like, and like what I'm thinking for like how to progress the project forward with him and my boss. But I get the vibe that this guy expects me to be a lot more referential to him. \n\n7  \n01:18:47\n\nAs in he'd like me to check in with him for like every little detail, but that's not really how I work. And he is like not really good at like recognizing what's important and he is not my boss. So the actual event is that usually I'll leave my notebook at like my desk or something, but always in the same place. And that notebook always, it has details about my experiments and that's like kind of it, I just like read everything down in it. When I got in on Monday, I couldn't find my notebook anywhere. \n\n7  \n01:19:27\n\nAnd. I spent like a good amount of time looking for it. Eventually it turns up in the place I always put it. But suspiciously timed after this guy shows up to work. I don't really have any hard, \n\n1  \n01:19:39\n\nThat's a pause real quick. That's awesome. To steal someone's shit and be like, I'll put it back when I get there. Like, I'm not getting there. I'm not getting there early. That's all. I kind of respect that guy for that move. Anyway. Go. Keep going. Let's we're almost, but \n\n7  \n01:19:55\n\nLike if he did actually do it, I'm pretty creeped out and annoyed. Like it seems like pretty micromanage And. I also like needed my book. Mm. I'm not really sure what to do. Like do I confront this guy? Do I like try to talk to him about it? Do I just leave it be, it's like a weird thing, but like it's not really like kind of that big of a deal. I just feel like, I don't know. I feel weird about it. Yeah, of course. Come me out. All right. Love y'all. Bye. \n\n1  \n01:20:34\n\nInteresting. I would, here's what I would do to see if he's stealing it. I would be like, I would put some shit in my notebook or switch it out and be like, oh this guy fucking Charles is, he's so hot. But when he, but only when he wears blue, I really want to fuck Charles when he is wearing a blue shirt. Mafiaa shit. He's so fucking hot. I don't know what it is. And if this guy starts coming around and fucking Teal polos, he stole. \n\n0  \n01:21:02\n\nWell you're assuming he's \n\n1  \n01:21:03\n\nStraight. That is true. That is true. I am assuming he's straight. \n\n0  \n01:21:06\n\nI thought this show was people calling up and being like, oh, I accidentally fucked my dog \n\n1  \n01:21:11\n\nSaid \n\n0  \n01:21:12\n\nThis is like somebody's cheating off of me. And. I can't prove \n\n4  \n01:21:15\n\nIt. \n\n1  \n01:21:16\n\nYou \n\n0  \n01:21:16\n\nLose the \n\n1  \n01:21:17\n\nFuck. I bet you we got one of those coming up right after this one. Connor. Don't you worry. \n\n0  \n01:21:21\n\nIt sounds so abstract. Like my science ideas. \n\n1  \n01:21:23\n\nLike I know what? Like well it's like, it's like she works, she's, she's working on a thing to like \n\n0  \n01:21:29\n\nInventions, \n\n1  \n01:21:30\n\nPulverize civilians probably. Yeah. She's working. There's no science gets funded in America anymore. It sounds like \n\n0  \n01:21:36\n\nHop goblin, Spider-Man science experiment. \n\n1  \n01:21:38\n\nYeah. It's a way to like completely. There's like a destruction ray she's working on for the Navy. \n\n0  \n01:21:44\n\nShe's a scientist. Why doesn't she poison this guy or something \n\n1  \n01:21:47\n\nSo true. Come up with a, a concoction that'll fuck \n\n0  \n01:21:51\n\nHim up. Or Oppenheimer, I don't know. I didn't see the movie. But he had his bike chain where If you went over a certain RPM. The bike chain would fall apart. \n\n1  \n01:21:58\n\nReally? \n\n0  \n01:21:58\n\nYeah. So he didn't lock his bike up anywhere. He just knew that he had to ride a certain speed. Oh. So maybe there's something with like booby trap your notebook. Yep. Where it like sprays like ink. \n\n1  \n01:22:10\n\nYeah. So the person opens it. An ink thing would be awesome \n\n0  \n01:22:13\n\nActually. And that's like science. That's \n\n1  \n01:22:15\n\nScience. Yeah. And you'd \n\n0  \n01:22:15\n\nBe like, I'm doing ink science. I don't know what to tell you. Yeah, \n\n1  \n01:22:18\n\nYeah. So, okay. \n\n0  \n01:22:20\n\nShe's working for Epstein and the guy stealing her notebook is Fauci. \n\n1  \n01:22:27\n\nYeah. Are you, wait a second. Are you trying to get us to take more vaccines bitch? Because then I'm on his side. Yeah. I mean This is so, this is so funny to be like to And I and everyone knows this vibe too, where it's like your older coworker is some dumb ass who didn't like, who's just not, hasn't kept up. Yeah. Was like, might have been good at something like 10 years ago. Yeah. But doesn't have the juice anymore and they're just trying to like clinging on for dear life. Yeah. I think you have to like, I think you have to, you do have to booby trap him somehow. Legit. I actually think you need a way. \n\n1  \n01:23:07\n\nMaybe it's not ink blowing up on his shit, but like you \n\n0  \n01:23:11\n\nCould get like a rig camera or something like that. \n\n1  \n01:23:13\n\nA camera or like something where it's like if your thing is moved it makes a fucking noise. Like, like it \n\n4  \n01:23:20\n\nIs like be beep beep beep beep beep \n\n0  \n01:23:23\n\nBeep. Or like what would they do? Like when you would go to the class trip to the state capitol? They would like tape the doors. Mm. So If you left. They knew it \n\n1  \n01:23:31\n\nWas wrong. I didn't know that. What's that? \n\n0  \n01:23:34\n\nI know I just, I heard they had \n\n1  \n01:23:35\n\nYou all in a room or something. \n\n0  \n01:23:37\n\nWell like there was an option in eighth grade. Like you'd go down to Springfield State, see the state And I. Remember I was a bad kid and they wouldn't let me \n\n1  \n01:23:45\n\nGo. But they were like, what you do man, \n\n0  \n01:23:48\n\nI think I wore a shirt that said like bull shirt on \n\n1  \n01:23:52\n\nIt. Bull shirt. It \n\n0  \n01:23:54\n\nWas like a Simpsons thing. And they're like, you can, they're like fine. I don't fucking care. \n\n1  \n01:23:58\n\nI don't fucking give a shit. I'm gonna drink a fucking, I'm gonna drink a Mickey's 40 and eat. I'm gonna go eat a Chalupa. You fucking bitch. \n\n0  \n01:24:05\n\nI'm gonna go eat and drink like a 45 year old man in the seventies. \n\n1  \n01:24:12\n\nI'm gonna have four microwave dinners. I'm gonna have four back-to-back Salisbury steaks and some Coors and some fucking Miller. High life fucking \n\n0  \n01:24:21\n\nBitch watched Seinfeld reruns on U pn. Call it a night. This is so beyond like I don't, I wouldn't know. She should just like \n\n1  \n01:24:32\n\nI would I? Okay. Yeah. I mean none of us real I mean Elvis had kind of a real job. The, he's the one who's had a real job though. \n\n0  \n01:24:38\n\nI've never had a job where this is like, oh, a notebook is important. Yeah, yeah, yeah. I've only had jobs where it's like you have to be here and make sure the door is closed. Yeah. \n\n4  \n01:24:47\n\nOkay. \n\n1  \n01:24:50\n\nMove this corpse. Yeah. Or make sure \n\n0  \n01:24:53\n\nStraighten these cords out. Yeah. \n\n1  \n01:24:57\n\nYeah. I mean I would I literally, I'm not kidding. I actually would. You, you have you, you're suspicious but you have no proof. Right? So I would make sure that he actually is taking your shit. Whether that's hidden camera or whether that's some kind of funny booby trap. And then you can confront him honestly. But it doesn't seem like, it's also seems like he's not stealing her shit to get ahead. He's stealing it to like pretend he's her boss and check up on her is what it seems like. Like it doesn't feel like it doesn't, yeah. I mean fuck this guy. If he's not your boss, he can suck your dick. \n\n1  \n01:25:37\n\nAnd I would just make sure he's not fucking clearly if he's, if if he took your shit, he's not the kind of guy that like a conversation is gonna like clear thing. He's not gonna be like, oh yeah, my bad. I'm sorry. He \n\n0  \n01:25:49\n\nMight be like, whatever. I don't know. I thought it was for all of us. \n\n1  \n01:25:53\n\nYeah. Yeah. Or I would have a bootleg. I would also have like a Nah, but this is too involved to have a fake journal where you, you write wrong things in it. I would try that. That could, that could be fun. Alright. Duplicate your current journal and the newest pages. Make them fake and make it look \n\n0  \n01:26:10\n\nLike a Patrick Bateman journal. Like at the end of American Psycho. \n\n1  \n01:26:13\n\nYeah. Yeah. \n\n0  \n01:26:14\n\nPut that out. See what happens. \n\n1  \n01:26:15\n\nHell. yeah. But yeah, good luck. I mean you Know. This guy seems like a fucking dickhead but you Know Fuck him. And. I say catch him his game. We're giving \n\n0  \n01:26:24\n\nOut the area codes right \n\n1  \n01:26:25\n\nGame. We're not, no. Okay. you Know that area code. \n\n0  \n01:26:27\n\nNo, I was trying to figure it out. Mm \n\n1  \n01:26:30\n\nMm We'll look it up later. Mm. Who else needs our fucking expertise? ELSs. \n\n7  \n01:26:37\n\nHi Stavvy. I have, I've been talking to this person, a guy for about a year and we've never met each other. But. we used to match each other's energy like texting back and forth. Okay. On and off. But you Know, it just seems like it has dwindled down to almost nothing. And like it'll take him like 16 hours to respond. Which I'm like, are you just not interested? Like what is your problem? And then I also have another problem of when I block people, men and it's usually abrupt 'cause I just get tired of them. \n\n7  \n01:27:17\n\nMm. They make a new like phone number or Snapchat and try to contact me. Like, so what does that mean? So it's just like the ones that I want don't want me and the ones that I don't want want me. And yeah. \n\n1  \n01:27:30\n\nThat's how it works. They're \n\n7  \n01:27:31\n\nVery confusing. So I would just like your advice. Advice about that. \n\n1  \n01:27:35\n\nOkay. Well first of all you're, you're complaining that a guy takes too long to text you back and he's not that interested. Like put yourself in these guys' shoes that you block. Would you want this guy to block you? Maybe you do. Maybe she's a very direct person. She's like I get the, I get the thing. But it's like I wouldn't go with the Insta block if the guy's not being really strange. I would just let the conversation dwindle and kind of take a page outta this guy's book who doesn't seem that interested in you and just kind of slowly let it you Know go away. \n\n0  \n01:28:10\n\n16 hours is so specific. \n\n1  \n01:28:12\n\nYeah. 16 hours is pretty specific. But it also kind of makes sense too. \n\n0  \n01:28:17\n\nBut it might, it's \n\n1  \n01:28:18\n\nLike middle of the next day. \n\n0  \n01:28:19\n\nYeah. you Know. Is this like a thing that's like she likes that she doesn't, if he was like all you Know kinda \n\n1  \n01:28:26\n\nIf she was on her dick. Yeah. Making you, making you Google voice numbers to block \n\n0  \n01:28:31\n\nBlock. But instead it's like, oh, you're not giving me attention. Okay. \n\n1  \n01:28:36\n\nYeah. And also like you never met this fucking guy. I mean maybe this is a, a youth thing and it's \n\n0  \n01:28:41\n\nLike, might not be real \n\n1  \n01:28:42\n\nKids. Well it's just like I do feel like younger some, some Gen Z motherfuckers will have entire relationships and never meet each other. Yeah. But I still am a little bit of the like \n\n0  \n01:28:52\n\nI mean I work with people that I've like meet like two years later. Yeah. Like just doing video stuff. \n\n1  \n01:28:59\n\nYeah, yeah, \n\n0  \n01:28:59\n\nYeah. But that's, we're not fucking, \n\n1  \n01:29:01\n\nYou're not trying to suck him off. Yeah, yeah, yeah. Or suck her off I know. Yeah. Maybe. Who's the hottest guy you work with? You wanna suck you dude. Yeah. Thanks man. That's awesome. That's nice of you to say. I don't really want you to suck my dick though man. I'm sorry. \n\n0  \n01:29:17\n\nI know I feel so she's wants this guy to text her back or she's like, what the fuck's the deal? And then other, so it seems like she's getting a lot of people texting. \n\n1  \n01:29:27\n\nShe's on, she's texting, she's on Snapchat. Look, this is not a very complicated question. This is how life goes. Yes. You the people you don't wanna fuck you find annoying and the person you do want to fuck if they don't give you the right attention, it makes you sad. You're just gonna have to keep at it sister until you find somebody that actually wants to, you Know meet up with you. But a guy that you've never met and also a guy that's never tried to meet up with you. Yeah. That's a guy that's just kind of like he maybe keeping you on the back burner. Maybe he's a coward. Maybe he's just found someone easier closer nearby and like what does it mean that the guys are getting are making you phone numbers could mean two couple things. \n\n1  \n01:30:09\n\nOne, these are all fucking lunatics. Two though. You say it's abrupt, right? So they might be literally confused. Like if it goes from a pleasant conversation to green text bubbles, you're gonna be like, what the fuck? That was weird. Let me try and get in contact with her, see if everything's okay. \n\n0  \n01:30:26\n\nDoes that mean that it's blocked \n\n1  \n01:30:27\n\nSometimes If it goes from iPhone to green bubbles? \n\n0  \n01:30:30\n\nYes. Interesting. Sometimes \n\n1  \n01:30:31\n\nIt does mean that. That's \n\n0  \n01:30:33\n\nA big problem for me now. \n\n1  \n01:30:34\n\nYeah. So yeah. I don't know. \n\n0  \n01:30:40\n\nThese young motherfuckers need to get out Some \n\n1  \n01:30:42\n\nYou need to get out. Touch some people. You need to touch some grass. You need to touch some cock. IRL. \n\n0  \n01:30:46\n\nYou need to do it. IRL you Know. They probably, I was thinking about this. Remember like when every city had like a gay neighborhood? Sure. Now that's gone now \n\n1  \n01:30:54\n\nEverywhere. Now every \n\n0  \n01:30:54\n\nNeighborhood's gay. \n\n1  \n01:30:55\n\nEverywhere. Every neighborhood's gay. Now you can suck and fucking in every bathroom stall from here to fucking jersey. Yeah. There used to be a nice contained place. Call it a little Madagascar. Yeah. Where they knew to stick around. This is just, you're fine. You're fine Here. Don't you dare let me see that shit where me and my children are. Look, \n\n0  \n01:31:16\n\nYou're gonna be grooming us. Dude. I can't come into work. I got groomed. I got groomed. Sorry. I got fucking groomed. I got \n\n1  \n01:31:25\n\nGroomed. I'm a 40 year old man. But I was convinced to, oh god. I \n\n0  \n01:31:28\n\nGot groomed together. \n\n1  \n01:31:29\n\nI got groomed. I got this \n\n0  \n01:31:31\n\nGuy. I went to the bathhouse and got groomed. I don't know what happens. I \n\n1  \n01:31:34\n\nTalk to me. Yeah. That is awesome. It's real. It is. It is. So that word is so quickly losing any meaning. Every word. Because they're just saying, oh yeah, gay people are all pedophiles. Also \n\n0  \n01:31:47\n\nSomebody has to have made this point. Right? Like with the book stuff. Like who is like, I might be gay, I'm gonna go to the library. And I was like, no, I'm gonna pull out my phone and search like the most hardcore pornography I can find. \n\n1  \n01:31:58\n\nYeah. I'm gonna do a test. I'm gonna pull up butt. I'm gonna search butt fucking in X videos. And if It does something to me, I'm going shopping for tighter jeans. \n\n0  \n01:32:08\n\nThat's what's going on. \n\n1  \n01:32:09\n\nAlthough actually now gay guys are, they're back. They're on baggy jeans. Yeah. \n\n0  \n01:32:13\n\nGood for us. Yeah, \n\n1  \n01:32:14\n\nIt's nice for it to come back. Yeah. \n\n0  \n01:32:16\n\nYeah. Big and tall. Finally \n\n1  \n01:32:18\n\nThey, the jeans I was wearing, 'cause I grew up in Baltimore, so it was like very baggy, throwback jersey style style of stuff. I feel like those jeans, I feel like gay people are wearing like jeans from rap videos when we were 16. Yeah. GE unit. Those tank tops were pretty gay too, by the way. The like tank dumps with the little \n\n0  \n01:32:36\n\nYeah, with the rib. Different. \n\n1  \n01:32:38\n\nDifferent The different ribbed \n\n0  \n01:32:39\n\nShit. Yeah. Or like his strips. Yeah. And then it went into like a bigger thing \n\n1  \n01:32:42\n\nBecause 50 was jacked. So he wanted to show off those pecs. That's a pretty, \n\n0  \n01:32:45\n\nHe's turned into a Fat guy. \n\n1  \n01:32:47\n\nHe's pretty Fat these days. \n\n0  \n01:32:48\n\nIt's really funny what his arc is now. He is just like, I own Vitamin Water and Fat. Yeah. \n\n1  \n01:32:52\n\nI'm rich, I'm Fat, I fucked. I like try people. I weirdly fucked Chelsea handler for like four months. Been like five years ago. Do you guys remember that? Oh yeah. 50 cent Chelsea. I wonder who he's fucking these days. I love 50 cent. Man. He came Right, right, right, right, right. At the right time for me. That \n\n0  \n01:33:09\n\nEra of rap is so funny. \n\n1  \n01:33:11\n\nYeah. We got 50, we got \n\n0  \n01:33:15\n\nThe game. The \n\n1  \n01:33:16\n\nGame. I guess all I'm thinking is all the like adjacent, you know, D 12, a lot of Eminem adjacent stuff. \n\n0  \n01:33:22\n\nIt was like in the sixties you had like you Know bands that were like trying to change the world or whatever. And then in the seventies it was like Led Zeppelin bad company. Yeah. Let's like, like we don't care. We're just about like assault. We're \n\n1  \n01:33:34\n\nPlaying music, we're gonna fuck children. Yeah. That is another, like, \n\n0  \n01:33:37\n\nThat's what happens \n\n1  \n01:33:38\n\nAround, everyone talks about gay people being groomers. It's like, don't listen to any classic rock. Yeah. \n\n0  \n01:33:43\n\nThose guys all, every classic rock song is like, I went into a high school and had sex with a child. \n\n1  \n01:33:47\n\nYeah. I won. \n\n0  \n01:33:48\n\nFuck a 12 year old. \n\n1  \n01:33:51\n\nIt's like they're talking about like, ha Donna, and then you're like, Donna was a local 11 year old lemonade sales stand girl that the Rolling Stones ran a train on. They put a tur, a snapping turtle in her pussy. Oh yeah. Was that \n\n0  \n01:34:07\n\nZeppelin? Yeah. \n\n1  \n01:34:09\n\nZeppelin apparently put a, a fish in a girl's pussy who was probably like, like every gr every famous groupie was like 14 to 16. It was, that's like so \n\n0  \n01:34:19\n\nFucked. That's like the song Dirty Laundry by Don Henley. \n\n1  \n01:34:22\n\nOh yeah. \n\n0  \n01:34:22\n\nThat's about like, you remember in Boogie Nights when like the 12 year old like ods of co like that happened at his house and like \n\n1  \n01:34:34\n\nGod damn \n\n0  \n01:34:34\n\nDude. And then like the paparazzi we like and he wrote this like victimized, like I'm a victim of the paparazzi. Yeah. Because I had like a child \n\n1  \n01:34:42\n\nWho amongst us hasn't partied with our sexy child and they die off cocaine at our house. And that's nobody's fucking business. \n\n0  \n01:34:50\n\nWhat do you want? \n\n1  \n01:34:51\n\nWhat? Come on. I'm in. People \n\n0  \n01:34:53\n\nDie at Disney World. Yeah, \n\n1  \n01:34:56\n\nYeah. Are you fuck are you, are you at a fucking Michael Eisner's house taking pictures? Because some little kid fucking died on the, on the, the, the Pirates of the Caribbean? No, I don't think so. Anyway, back to our friend here. So yeah, that's how life goes. You seem like a young person. You seem like you don't know that. That's how it, how things are. Life is dog shit. It's pain and suffering. It. Nothing ever really goes your way. Maybe you'll find someone that you actually connect with and like if match each other's energies back and forth, like you say and it dwindled, that means it's over. And he is kind of a coward. He is not gonna say, Hey, I moved on. But then again you kind of, you're reaping what you sow here because you don't, if you're talking to someone in your board, you just block them. \n\n1  \n01:35:41\n\nSo how \n\n0  \n01:35:41\n\nDo you do that over text though? You can't break it off. Like that's the only way to stop is just to \n\n1  \n01:35:47\n\nKind of let it You're right. Yeah. Peter, Peter off. \n\n0  \n01:35:49\n\nSo it's a little bit, I think that's a little bit of the social contract is like knowing like, okay, \n\n1  \n01:35:53\n\nYeah, yeah, you Know what's going on here. So just be realistic. He's Or \n\n0  \n01:35:58\n\nShow up at their house \n\n1  \n01:35:59\n\nOr Yeah. Find his IP address. \n\n0  \n01:36:02\n\nDXs him, swat \n\n1  \n01:36:03\n\nHim, dox him, swat him. Be like, is this what you want? You fucking as asshole me back. Text me back. I showed you my tits. And. I said your dick looked big even though it didn't. I'm being a good guy. Yeah. Sorry. That's how it is. you Know who you know most, that's most of, most of young love is like that. I would say, you know, most of young love is thinking you have a girlfriend then she calls you the next day and said she got fingered at a party by accident. And then you're like, oh well don't let it happen again. And then you don't. \n\n0  \n01:36:35\n\nI would slide this time. Yeah. \n\n1  \n01:36:40\n\nOh god damn. Do you have any Fat girlfriends in high school man that you are reading, drinking Paps with? \n\n0  \n01:36:45\n\nNo, I was basically asexual. \n\n1  \n01:36:47\n\nHell. yeah dude. \n\n4  \n01:36:48\n\nYeah. \n\n1  \n01:36:49\n\nIL again. I love that. That's a cute being Fat is like, you do get, you get you people that are Fat little cute asexuals. \n\n0  \n01:36:56\n\nYou're cherub you don't exist. No. \n\n1  \n01:36:59\n\nYeah. Yeah. That's, there are two modes. It's like cherub or like what I'm going with now. Which is like, \n\n0  \n01:37:05\n\nWell you, you have Seder, you have success and you have, \n\n4  \n01:37:09\n\nBut \n\n1  \n01:37:09\n\nLike, yeah. Yeah. No I was like that in high school too. I was like \n\n0  \n01:37:12\n\nParty guy. \n\n1  \n01:37:13\n\nNo, not a party guy. I was, I was the same way where I was like, I got no pussy whatsoever. \n\n0  \n01:37:17\n\nYeah. I'm just here on a mountain bike hanging out with you guys. Yeah. \n\n4  \n01:37:19\n\nWhat's going on? Alright, \n\n0  \n01:37:22\n\nYou guys are gonna go in that room and fuck. Cool. I'm gonna watch Entourage. \n\n1  \n01:37:31\n\nOh fuck. Alright, give give us a nice one. Big El. See what we got here. \n\n6  \n01:37:38\n\nHey Stubby. I love you man. So what the fuck's going on? I am a soldier. \n\n1  \n01:37:46\n\nOkay. \n\n6  \n01:37:47\n\nI'm in the army. And why are you whispering? I just got back from a deployment. \n\n0  \n01:37:53\n\nI'm about stolen. \n\n6  \n01:37:54\n\nI have spiraling pretty hard. \n\n1  \n01:37:56\n\nOh no. You \n\n6  \n01:37:57\n\nName it. Drugs, women, squandering money, all of that stuff. I'm going deep, like super fucking deep. Okay. And I'm trying to reintegrate myself into the civilian world and it's been very tough for me to do that because I don't have the structure right now. And, I have a job coming up, but it's just, it's been a little tough in the meantime to develop some form of a routine. So you got any advice for someone that just got out of a really structured environment and is now coming back to chaos? \n\n6  \n01:38:47\n\nWhat feels like chaos? Yeah. I've been on a bender, man. Help me out. Look bye. Damn \n\n1  \n01:38:54\n\nBro. You're alright. Get an awful lot. \n\n0  \n01:38:57\n\nI thought this show was like, me and my roommate are sharing butt plugs instead. This is like, we gotta get this guy's, we gotta call him. We gotta do wellness. Check on him. You And I gotta start giving him money. \n\n1  \n01:39:18\n\nYeah. This the fuck am I supposed to do here. I mean. Look buddy. I get it. I get it. you know, it is hilarious how much the army just does not give a fuck about these people. They're like, all right, figure it out for, you know, six \n\n0  \n01:39:31\n\nWeeks. Yeah \n\n1  \n01:39:32\n\nMan. And, but it's, it's, I also, I would love to see the kind of like, he's, he's a soldier. He's probably like, you know, he sounds pretty young. Probably came from a dog shit place. He probably has like $11,000 that he's buying pussy with. Yeah. \n\n0  \n01:39:48\n\nAnd he's like, \n\n1  \n01:39:49\n\nHe's probably buying just the worst. He's on meth just getting the worst head of all time. Got a \n\n0  \n01:39:55\n\nCharger he can't afford. \n\n1  \n01:39:57\n\nYeah, absolutely. Absolutely. 100%. Yeah. He's cruising. He's cruising for street pussy in his charger with the Hemi. Yeah. Buddy I mean look, he If you. You just, now I'm no fucking self-control expert here. Right. That's really not my strong suit. But I will say that you do kind of have to just set your own fucking goals here. You have to just, you have to create structure for yourself. It sounds like you're about to have a job that's good. But can you just re, can you just kind of recreate I mean not as strict as what the army has you fucking do, but it's like you just had a pretty structured thing. \n\n1  \n01:40:46\n\nDo you just need someone to hold your feet to the fire to get anything done? I mean This \n\n0  \n01:40:50\n\nMight also be like a pendulum swinging the other way. You need a little Yeah. Where it's like too much. We're in the military now. You've got all this freedom. Yeah. Going nuts. And then the job will you Know? Yeah. Hopefully that'll happen. \n\n1  \n01:41:02\n\nYeah, exactly. Don't \n\n0  \n01:41:03\n\nIf. you need help. Reach out for it. you \n\n1  \n01:41:05\n\nKnow what I mean? Yeah. Here's the thing. Go to the job man. Don't be like, don't be like, ah, I need a little work \n\n0  \n01:41:10\n\nTime's really this bad. Don't be calling a podcast. Yeah. Go to a doctor. Okay. \n\n1  \n01:41:15\n\nI know you need to go to fucking rehab. Honestly. Yeah. You need to go to some kind of treatment center, bro. It's not me. And Elvis don't got the answers for you. 'cause it's also like the army kind of just sets you up and it's like they, they're just using you as like cheap labor. They don't really give a fuck about you. It's probably hard on your, I don't know if you've done anything bad, but that's probably hard. Just being in the army is probably not good for your psyche, let alone like when you want all this freedom to be like your, your, you Know your buttoned up. But it sounds like you just have some underlying substance abuse and control issues that you should go to I know if it's rehab or if it's like you Know counseling or, or what. \n\n1  \n01:42:00\n\nAnd by the way, you should have some kind of resources here through the army, don't you think? Like \n\n0  \n01:42:07\n\nI think they're really fucked too. Yeah, \n\n1  \n01:42:09\n\nYou're probably right. Yeah. I mean, look how many homeless people are fucking \n\n0  \n01:42:12\n\nVeterans. I mean \n\n1  \n01:42:12\n\nVa \n\n0  \n01:42:13\n\nVa shit. But but maybe that I mean they probably get at least a therapist or something like that. Yeah. Yeah. \n\n2  \n01:42:17\n\nHe'll contact the va. They'll be like, have you considered doing another tour? \n\n1  \n01:42:21\n\nYeah, yeah, yeah. It get your mind right. The the VA's like, oh, interesting. Why don't you come into this room and it's just a gun with one bullet in it. \n\n0  \n01:42:33\n\nI mean if the job's coming up, he might get back on the job and kind of be a little bit better. \n\n1  \n01:42:38\n\nSo is he, is he discharged? I don't get it. He just got back from an employment deployment. 'cause here's the thing, if you're still enlisted the, you are still a investment for the army, so they might actually give a fuck about you. \n\n0  \n01:42:54\n\nIt's, well, I think when you, even when you're done, I think you have to do like National Guard or like state. Right, right. You like, and that's for a \n\n1  \n01:43:02\n\nCertain amount of time. Yeah. Yeah. But if they, if they think you're gonna go back out on deployment, I guess my point is they might have resources. 'cause it's like If, you kill yourself now. They really haven't gotten their money's worth outta their training. So they \n\n0  \n01:43:14\n\nMight I mean, this is making me think like, thank God I was Fat in high school. Yeah. Because I was just did not exist to the recruiters. You think you did you ever recruiters, you like show up. Like there were always recruiters in the \n\n1  \n01:43:24\n\nThere were and you're right. I was too Fat \n\n0  \n01:43:26\n\nTo even, they just were like, we, you don't exist to me. \n\n1  \n01:43:28\n\nBut I was, yeah. I would've never You think you would've been gotten recruited? \n\n0  \n01:43:33\n\nI think I was dumb enough to just to dumb. But you know, like I mean they pray after. Of course I wasn't, I didn't go to college. Right, \n\n1  \n01:43:42\n\nRight, \n\n0  \n01:43:42\n\nRight. But \n\n1  \n01:43:44\n\nThere was no way. I don't know. I I I knew I was, I had a little too much antiar going on even in high school. Yeah. El ELSs keeps talking about how he wants to join the Army. To this day, ELSs thinks he could be \n\n0  \n01:43:56\n\nCould Ed until you're 35 to join the Navy. \n\n2  \n01:43:58\n\nI need the structure. I can lose weight. Get like a little \n\n0  \n01:44:01\n\nFit. Look at what It did for Hunter Biden. \n\n1  \n01:44:05\n\nYou got till 35. Yeah. ELSs. You got what? Four more months? \n\n2  \n01:44:09\n\nCould I do it? \n\n0  \n01:44:11\n\nMaybe. I think so. It'd be fun to be on a big boat with all your friends. \n\n2  \n01:44:15\n\nYeah. you Know Maybe you get to experience killing a person, like legally lawfully like you Know. I don't want to, but that could be just a life experience \n\n1  \n01:44:27\n\nOr something. A possibility. No, that's a good point. Yeah, dude, go \n\n0  \n01:44:31\n\nGet some help, brother. \n\n1  \n01:44:32\n\nGet some real help, \n\n0  \n01:44:33\n\nBro. Reach out to somebody. Maybe there's some veterans support groups or something like that. Don't look at this fucking guy. \n\n1  \n01:44:40\n\nJesus Christ. It ain't gonna be me, pal. I I could just tell you what stop, which is what I would tell you is like, chill out. \n\n0  \n01:44:48\n\nLook, you want advice from me on, I can give you advice on how to get you Know 10 PornHub tabs going at the same time. That's about \n\n1  \n01:44:56\n\nIt. The best browser for jacking off. Yeah. So yeah. Good luck pal. Sorry we don't have more for you, but you do just make, I would say get professional help to the point where you're not fucking up the job because that's, \n\n0  \n01:45:10\n\nNo, this might be like a deep point of shame for him. Like you Know when you're like on a bender or something like, oh fuck. Sure. And this might be we swing back, but like Yeah. If, you don't, well then, \n\n1  \n01:45:19\n\nYeah. Yeah. You don't want to keep going down the bender. Love \n\n0  \n01:45:23\n\nYou brother. \n\n1  \n01:45:24\n\nBut. we love you. And, and why don't you give something fun for us to end on Elvis. is this, you think you got it? \n\n2  \n01:45:30\n\nI think so. Okay. \n\n1  \n01:45:32\n\nLet's see. If, you did it. \n\n5  \n01:45:34\n\nHey, stop. So here's my question. Love your standup and all that shit. Roses, roses, roses. Okay, so I have hemorrhoids. Okay. And I'm also broke. So I use a Sharpie to deliver Aquaphor into my asshole. Super embarrassing is what it is. And I also have IBS blah blah, blah, blah. The, the question that I have is nice. Dude, I've seeing this girl for a while and the same sharpie that I would use to deliver the Aquaphor into my ass. \n\n5  \n01:46:23\n\nWell, I saw her using it the other day. Oh, what? And she has a weird habit of like putting pens in her mouth and she put that Sharpie in her mouth and you Know. I I, I do try to keep it clean just because like, sanitary reasons, but hold, I \n\n1  \n01:46:48\n\nPause this ELs. Now you, I don't know if you've been diagnosed, you have you, what does, what do you think he means by Sharpie to put Aquaphor in his ass? Like you think he puts Sharpie, he puts Aquaphor on the tip of the Sharpie. Like his \n\n0  \n01:47:03\n\nToothbrush? \n\n1  \n01:47:04\n\nYeah. And he shoves it up his ass. \n\n0  \n01:47:06\n\nSometimes they have internal. Yes. \n\n1  \n01:47:08\n\nOkay. \n\n2  \n01:47:09\n\nI've I've used hemorrhoid cream before. \n\n1  \n01:47:11\n\nAnd what do you do? You put it up, you put a finger up your ass. \n\n2  \n01:47:14\n\nWell the, it was like a prescription ointment. Okay. There's a little plastic tip that you put on top of it. Syringe s Oh, but not sharp like a syringe, but it has like holes on the side and \n\n1  \n01:47:25\n\nYou put it up your ass and you squeeze. \n\n2  \n01:47:27\n\nYeah. I I was never really completely sure like how you're supposed to use it, but I think you kind \n\n0  \n01:47:31\n\nOf put it hemorrhoids and, and you just, it's topical. So you put, sometimes you have internal, you put a \n\n1  \n01:47:36\n\nLittle cream up your ass and you Yeah, \n\n2  \n01:47:37\n\nI think, I think mine were little on your, so I needed a little adapter for the asshole. Mm. But you \n\n1  \n01:47:43\n\nKnow. So is this guy pouring Aquaphor under the side of a sharpie and sticking it up his ass? Do you think \n\n0  \n01:47:49\n\nHe's fucking his ass with the sharpie? Just not very deep probably. \n\n1  \n01:47:54\n\nYeah. \n\n0  \n01:47:54\n\nJust to get some Aquaphor on the inside of his asshole \n\n1  \n01:47:57\n\nSharpie. Interesting. Why \n\n0  \n01:48:01\n\nWould you, it's weird to then just like, I'll put this with the other pens. Yeah, \n\n1  \n01:48:03\n\nThat's the thing. It's like, keep that in the medicine cabinet. That's fucking crazy. Okay. \n\n0  \n01:48:08\n\nIf you at home don't know that we can the Google translate, we can see the, so it in my mind, all of these I'm like, sounds like they're reading. Yeah, \n\n1  \n01:48:16\n\nBut I'm, I'm reading. You're reading. Yeah, yeah, yeah. But this, \n\n0  \n01:48:19\n\nThis might be, somebody might be doing a little skit here. \n\n1  \n01:48:22\n\nThis feels a little fake. ELSs But. we, we'll see. Let's, let's see, let's let the rest of it go. \n\n5  \n01:48:29\n\nI'm wondering if I should tell her she's never eaten my ass. So there's, so there's that. Yeah. So am I still seeing her on and off? But yeah, I don't know. Just feel strange. Dude. Tell her, should I not just like let a sleeping dog lie? \n\n1  \n01:48:53\n\nWhat do you mean? Tell her \n\n5  \n01:48:54\n\nAnd hey, \n\n1  \n01:48:55\n\nThat Sharpie I know I put it up my ass. What the fuck do you mean teller? This guy's full of shit. Is there anything more? Is there anything else? \n\n0  \n01:49:04\n\nThere might be something towards \n\n1  \n01:49:05\n\nThe end. \n\n5  \n01:49:06\n\nI know if I can hide my face if I see that. I don't know. Maybe just hide the pen. I don't know. This is fucking I know I'm trash. I got it. It's fucking, your advice would be appreciative. And if nothing else, maybe a oh, a fucking Okay. Story to share with your next guest anyway. Bye. \n\n1  \n01:49:25\n\nThis guy is really too pleased with himself. \n\n0  \n01:49:27\n\nYeah. This is a little I mean. I don't know. Imagine this actually happened. \n\n1  \n01:49:31\n\nNow I'm actually, maybe he's not making it. Maybe he, Hmm. Yeah. This feels a little like, he's like, oh, this crazy story. \n\n2  \n01:49:40\n\nYeah. I think he wanted to share the story a little bit. \n\n1  \n01:49:43\n\nHe doesn't really have a question. Right? He's just puts, I guess I could see somebody putting aquifer up their ass with a Sharpie. \n\n0  \n01:49:51\n\nI mean I've had hemorrhoids when I was didn't have money. It's not that expensive. Right? It's something you can spring for also. \n\n1  \n01:49:59\n\nAquifer's expensive. \n\n0  \n01:50:00\n\nYeah. \n\n1  \n01:50:01\n\nIsn't it? Search. Look up what aquifer costs. Look up what? Hemorrhoid Cream costs aquifer. Okay. A 3.5 ounce jar is $9 at Target. \n\n0  \n01:50:17\n\nIf, you go to like, I I I heard that hemo like you get hemorrhoids. If, you smoke crack. \n\n1  \n01:50:25\n\nInteresting. \n\n0  \n01:50:25\n\nSo in a lot of neighborhoods where there's high crack use, they put the hemorrhoid cream behind Plexiglass. That's what I heard. They had a friend that had Hemorrage Crack gives you hemorrhage, lived in a bad neighborhood and was like, I had to ask somebody. And I went to ACVS downtown LA like half of the store is behind place. Yeah. \n\n1  \n01:50:43\n\nYeah. The one downtown LA is fucking insane. It's \n\n0  \n01:50:45\n\nIt's a different universe. \n\n1  \n01:50:47\n\nIt's fucked up. That's like Mad Max down there. \n\n0  \n01:50:49\n\nIt is insane. \n\n1  \n01:50:50\n\nOkay, now look, A one ounce hemorrhoid ointment is $6. This guy's full of shit. Fuck this guy. Well this, you blew it again on the last call. \n\n0  \n01:51:01\n\nWhat a piece of shit. \n\n1  \n01:51:03\n\nThis to me, some fun for our friend Connor to go out on. And then we have this guy clearly lying about putting aquifer up his ass with a sharpie \n\n0  \n01:51:10\n\nBecause everybody has done some kind of version, not exactly this, but some kind of like, I have to do this disgusting thing or whatever. Yeah. You then that Sharpie then becomes like e it's like O j's gloves. Yeah, yeah, \n\n1  \n01:51:25\n\nYeah, \n\n0  \n01:51:26\n\nYeah. Like you're not putting it out. You're like, you're \n\n1  \n01:51:27\n\nNot putting it out somewhere. Easily accessible. Yeah. Yeah. This guy's, I didn't like his whole thing. And what Roses, \n\n0  \n01:51:34\n\nRoses roses up top made me think, what is this? \n\n1  \n01:51:37\n\nYeah. I didn't like his vibe. And it would be funny if he's not, if he is telling the truth. \n\n0  \n01:51:41\n\nIf I see you on the street, I'm putting a fucking hole in your head. Taking a piece of rebar, \n\n1  \n01:51:47\n\nPop, pop, \n\n0  \n01:51:48\n\nPop right in your fucking stab you in the head with a rusty piece of rebar. Don't fucking swear. \n\n1  \n01:51:54\n\nDon't ever, \n\n0  \n01:51:54\n\nDon't fucking lie about this shit. Don't \n\n1  \n01:51:56\n\nLie dude. This is sacred stuff here. Well, okay, I think that's gonna do it. you Know not a really great crop of questions this episode, but you Know, what are you gonna do? \n\n0  \n01:52:08\n\nDefinitely contact suicide hotline. \n\n1  \n01:52:14\n\nDon't \n\n0  \n01:52:15\n\nCall this place. \n\n1  \n01:52:16\n\nDo not call this place. And don't lie about putting stuff up your ass. Yeah. Call \n\n0  \n01:52:20\n\nThis place. If you're like, oh, I left my porn out. Yeah. When my, \n\n1  \n01:52:25\n\nI think my dad friend. \n\n0  \n01:52:26\n\nMy dad. \n\n1  \n01:52:26\n\nMy dad. My dad used my pocket pussy. Yeah. I'm pretty sure my dad used my pocket pussy, but I'm not positive. \n\n0  \n01:52:32\n\nYeah, \n\n1  \n01:52:33\n\nWe will help you out with that. \n\n0  \n01:52:34\n\nMy, yeah. \n\n1  \n01:52:36\n\nHere's how you Know. Here's what you do in that situation. Put a little hot sauce in your pocket. \n\n0  \n01:52:39\n\nPussy. Little prank on Dad. You \n\n1  \n01:52:41\n\nHear your dad go, ah, you Know. you Know. He used it. All right. There we go. We invented a good question to answer. That's a good question. Question. Yeah. Because Elvis blew at this episode. He take what you get This's. What? It's Connor, thanks for being on the show buddy. Thanks for me brother. Of course. Anytime. Go watch The. Mask, go watch Connor's shit and we'll talk to you guys next time. Bye. Bye. \n\nLogin required - message us in the chat bubble below for access!\nLog In\n1"}}