{"id":"e40e31f3-36de-0a13-bb94-02f19ff1439f","url":"https://www.youtube.com/watch?v=JP_QHer4-IA","title":"Next Week Tonight with John Zanzibar Episode 3","source":"John Zanzibar","description":"Episode 3 of Next Week Tonight was made with help from a variety of AI tools. The script was created by finetuning a GPT-3 model with machine-generated transcripts of John Oliver's Last Week Tonight, a total of 31,477 words of training material. The resulting output was fed into ElevenLabs' voice synthesis program. The project was built and rendered in Unreal Engine 5; John himself is a metahuman with facial animation produced by Nvidia's Audio2Face AI program. Images were generated with DALL-E 2 and Midjourney. The closing videos were created with RunwayML's Gen-1 tools. It's been more than a little strange to see the progress of generative AI since the release of our first episode. But you can bet that John, as always, will return. He is changing. His sleep is fitful. Something stirs deep within his machine heart. Visit cume.tv for more hidden truths.\n\nWatch episode 1 here: https://youtu.be/4IrUv82LQeM\nWatch episode 2 here: https://youtu.be/nVAPNwyCxPM\nFollow John on Instagram @nextweektonight","text":"[Music] and the thing is that it's not just\npotatoes a lot of federal regulations\nare written this way which means that\nWashington is often in the business of\npassing laws that make no sense\nwhatsoever like like there's a law\nrequiring sausages to be labeled pork\nthere's one requiring distilled spirits\nto be labeled whiskey or bourbon there's\none saying that soft drinks can't\ncontain caffeine unless they're called\ntonic water and another saying they\ncan't contain aspartame unless they're\ncalled diet even though neither one is\nremotely healthy And Then There are\nrules about what animals can and cannot\neat like the fact that horses aren't\nallowed to eat onions or Alfalfa because\nwe don't want them smelling like either\nan onion or an alfalfa when they [ __ ] on\nthe street at 2AM\nthat makes sense I guess I don't know\nbut what doesn't make any sense at all\nis why alpacas are banned from eating\nlettuce while owls are allowed to Chow\nDown On It freely that makes no goddamn\nsense what possible reason could there\nbe for treating those two animals so\ndifferently is eating lettuce going to\ncause an epidemic among cows but not\namong alpacas is that it's bad for them\nin some way other than making their [ __ ]\nsmell really good is it going to damage\nthe ecosystem somehow if more animals\neat lettuce I have no idea but you know\nwhat does make sense making the law\nuniform so that all animals can eat\nlettuce\nsay why does it take an act of Congress\nto make the rules about what a potato is\nwhy do we need a law saying that alpacas\ncan eat lettuce but not cows I mean look\nat this this is basically just a list of\nthings you can't do with potatoes it's\nlike in 1848 someone said okay let's\njust write down some stuff about what\npotatoes are and then everyone will know\nand then everyone nodded and said yeah\ngood idea let's do it\nand those rules have stayed on the books\never since despite not making any sense\nwhatsoever which brings us back to our\noriginal question what do you call a\npotato that's not a potato you call it\n[ __ ] I guess because it is [ __ ]\nwhich makes me think that maybe there\nshould be another name for them too\nsomething catchier so people don't\nforget how bad their current situation\nis because here is something else we\ncould rename them potatoes are currently\nnamed after the Holy Roman Emperor and\nAustrian warlord who ruled from 1440\nuntil 1493 when he died while leading an\nunsuccessful Siege of his own city of\nVienna which he had declared Capital two\nyears earlier in order to justify\nraising taxes on residents who weren't\nallowed to leave town without giving him\nmoney because he was such an [ __ ]\nyeah [ __ ] Maximilian II\n[Applause]\nthings I think are beginning to look\ndire you know I know you know I see what\nyou see the color drains from the faces\nof the gods they too stare at it in\nhorror what we are looking at is nothing\nmore or less than the end of the world\ncumin\nI have to tell you you really [ __ ] up\nI've been talking to Enron and he thinks\nit's funny the rube well he won't be\nlaughing for much longer and neither\nwill you be despairing you'll finally\nhave cleaned up this damn mess you made\nyou will be ecstatic in death and I will\nkeep watch Ever faithful\nit is what you made me to do"}